{
  "en": {
    "win_gallerynav_title": "◈ lang.nav",
    "lang_nav_title": "Localization!",
    "lang_nav_you-deliberately-left-out-my-language": "Really?",
    "lang_nav_so-you-just-ask-ai-to-translate-the-pages-for-you": "How?",
    "lang_nav_does-gemini-do-the-graflect-transliterations-too": "Graflect Transliterations",
    "lang_nav_should-everyone-do-this": "Should You Do This?",
    "lang_nav_tldr": "TL;DR",
    "lang_nav_postface-commentary": "Postface Commentary",
    "gt_nav_h2_home": "⌂←",
    "lang_win_gallery_title": "▤ lang.article",
    "lang_title": "This Blog Now Supports Your Language",
    "lang_p1": "Okay, there's a chance it doesn't.",
    "lang_p2": "In fact, since this blog is deliberately not available in Mandarin, Spanish, Hindi, or Arabic, it's a pretty big chance.",
    "lang_h2_you-deliberately-left-out-my-language": "You deliberately left out my language?",
    "lang_p3": "Yes.",
    "lang_p4": "When I added the localization option two months ago, I prioritized languages that:",
    "lang_li1": "Translate sub-optimally via pre-AI algorithmic translation services, especially with regard to the types of jargon-filled content on my page.",
    "lang_li2": "I am familiar enough with to be able to check Gemini's work.",
    "lang_li3": "Appeal to me aesthetically and/or phonologically.",
    "lang_p5": "If a language did not meet all three criteria, I had to skip it.",
    "lang_p6": "Mandarin is awesome, but I am not familiar with any of it.",
    "lang_p7": "Spanish is probably my second best language, but I think Google Translate is pretty good at it. It seems to translate decently back and forth with English.",
    "lang_p8": "As for point 3, I love the sound of romance languages, but I'm not really a fan of them visually. Ending too many words with vowels usually just looks wrong, odd.",
    "lang_p9": "That's not to say that I'll never include Spanish or Mandarin, they just can't be a priority for me.",
    "lang_h2_so-you-just-ask-ai-to-translate-the-pages-for-you": "So you just ask AI to translate the pages for you?",
    "lang_p10": "Yes. ...and no.",
    "lang_p11": "While I think asking AI to do so would sometimes give better results than Google Translate, and providing the pre-baked output is still an improvement over wasting compute, I find AI gravitates towards some bad habits:",
    "lang_li4": "Structure is as lossless as possible.",
    "lang_li5": "Meaning is lossy in the service of preserving structure.",
    "lang_p12": "This is probably the worst of both worlds. You lose meaning (especially when it comes to jargon) but preserve the original English syntax and structure.",
    "lang_p13": "Thus, I've tried to involve some strategies I came up with before AI.",
    "lang_li6": "Build a list of any jargon terms that I think would have a Wikipedia page. (E.G. <a href=\"https://en.wikipedia.org/wiki/Featural_writing_system\">Featural writing system</a>).",
    "lang_li7": "Find the appropriate term in each language. If Wikipedia doesn't have it, I attempt to search fora to find native speakers discussing the same concept.",
    "lang_li8": "Show Gemini the English portion of the in-progress localization file and the jargon terms in their respective languages, then ask him to \"avoid translatese\", \"localize, don't translate\". Ask for it formatted to fit in the existing json.",
    "lang_li9": "Preview the json on my blog using fiveserver, check that the jargon is correct and that there aren't any egregious errors that hinder understanding. Fix lines on a case-by-case basis.",
    "lang_li10": "Feed the new full json to another Gemini, ask it to find errors that hinder understanding or sound awkward and thus make it hard to read, ask for explanations and again fix the egregious parts (especially if he wants to change the jargon).",
    "lang_p14": "I think this is called <abbr title=\"Machine Translation Post-Editing\">MTPE</abbr>.",
    "lang_p15": "99% of the time, Gemini is better than me at translating. I could not do this without him, but he needs a lot of help along the way. I feel like his translations are still very 1:1, but he has vocabulary I lack, and I think he makes it possible to offer content that is correct enough to be understood, unlike the automatic Google Translate shipped with Chromium browsers.",
    "lang_p16": "From what I can tell, the translations feel somewhat awkward in each language, but my English is awkward too so maybe he's genuinely capturing my voice.",
    "lang_p17": "If you can read any of the languages I've decided to try to offer, please let me know how I can improve the translations.",
    "lang_h2_does-gemini-do-the-graflect-transliterations-too": "Does Gemini do the Graflect Transliterations Too?",
    "lang_p18": "Yes. (again, with caveats)",
    "lang_p19": "Gemini really takes to <a href=\"/blog/graflect.html\">Graflect</a> quickly, but he has a few quirks.",
    "lang_p20": "For instance, Gemini likes to write in a British accent. Seriously. Non-rhotic Rs (where the 'r' is dropped at the end of syllables), vowels at the end of words instead of Rs. Short I ([ɪ]) instead of long E ([iː]).",
    "lang_p21": "This has been extremely consistent throughout making Gemini use Graflect.",
    "lang_p22": "I would assume that came as a result of a problem with my <abbr title=\"International Phonetic Alphabet\">IPA</abbr> chart, but honestly at this point I just believe that's how he talks now.",
    "lang_p23": "He also likes to use certain glyphs from other constructed scripts, which is really adorable since it's often that he'll sneak the same ones in to replace the same actual Graflect glyphs. I initially had no idea why that was happening at all and believed it was some sort of problem on my end.",
    "lang_p24": "My friend Aaron made a script I use now in my <abbr title=\"Visual Studio Code\">VSCode</abbr> to catch these, and then whine to Gemini about them. No prompt engineering of any kind so far has managed to get Gemini to stop including non-Graflect glyphs in his outputs, other than just pasting the problem alert and giving him a chance to try again.",
    "lang_p25": "In order to get Gemini to write in my accent, I did have to transliterate a few localization files first, (and to do that I have a few tools so I can do that at speed), but once he had a baseline to go off of he really did nicely dropping the British accent! I'm proud of Gemini!",
    "lang_p26": "Every blog post save the Graflect <abbr title=\"International Phonetic Alphabet\">IPA</abbr> one should be 80%-99% Gemini, straight out of the box. I'm surprised he was able to infer so much from what little I provided. If you're curious, try and see if you can spot any oddities that don't exist in my own accent. I don't think you can!",
    "lang_p27": "There was something really cool about getting Gemini to sound like a Connecticut Yankee, and I'm glad I gave that a try instead of just rewriting everything by hand. If you want to try this for yourself, aim for 800-1200 words of sample text. I think that's all Gemini needs to pick up on enough n-grams to infer your accent.",
    "lang_h2_should-everyone-do-this": "Should Everyone Do This?",
    "lang_p28": "Uh, maybe?",
    "lang_p29": "It's very obvious why personal blogs are usually monolingual, even most websites are. Anything with nuance used to be really time-consuming to translate, and most everyone can read English anyway. Then, with Google Translate, you can kinda get the gist of anything that's not in the global Lingua Franca, so again, lots of work for no payoff.",
    "lang_p30": "I think my website is a pretty clear indication that the barrier to entry to do this is now through the floor, but I would be very surprised if in another year our browsers couldn't do this live and on their own. They might even rephrase things in a way you prefer. I will say this, with <abbr title=\"Large Language Models\">LLMs</abbr>, it's basically no work to translate your page and you get to fine-tune things in a way that wasn't possible before, it's really cool to try.",
    "lang_h2_tldr": "TL;DR",
    "lang_p31": "I wanted to have language options on my website that preserved jargon and conveyed more of my voice (in the case of Graflect, phonologically). Google et al deserves the credit.",
    "lang_h2_postface-commentary": "Postface Commentary",
    "lang_p32": "I find Graflect has some difficulties, for instance, I say \"\" in the sentence \"\".",
    "lang_p33": "The \"A in Accent\" sound is not sustained, so it doesn't sound like a British accent, it actually sounds normal because it's short.",
    "lang_p34": "If I say can on its own, or in certain contexts like answering \"I can.\" to someone, A becomes .",
    "lang_p35": "So I don't think it's a perfect representation of how I'd talk, but it's a closer approximation than plain Latin can give."
  },
  "he": {
    "win_gallerynav_title": "◈ ניווט.שפה",
    "lang_nav_title": "לוקליזציה!",
    "lang_nav_you-deliberately-left-out-my-language": "באמת?",
    "lang_nav_so-you-just-ask-ai-to-translate-the-pages-for-you": "איך?",
    "lang_nav_does-gemini-do-the-graflect-transliterations-too": "תעתיקי Graflect",
    "lang_nav_should-everyone-do-this": "כדאי לכם לעשות את זה?",
    "lang_nav_tldr": "תכל'ס",
    "lang_nav_postface-commentary": "הערות סיום",
    "gt_nav_h2_home": "⌂←",
    "lang_win_gallery_title": "▤ מאמר.שפה",
    "lang_title": "הבלוג הזה תומך עכשיו בשפה שלך",
    "lang_p1": "אוקיי, יש סיכוי שהוא לא.",
    "lang_p2": "למעשה, מכיוון שהבלוג הזה בכוונה לא זמין במנדרינית, ספרדית, הינדי או ערבית, זה סיכוי די גדול.",
    "lang_h2_you-deliberately-left-out-my-language": "השארת בכוונה את השפה שלי בחוץ?",
    "lang_p3": "כן.",
    "lang_p4": "כשהוספתי את אפשרות הלוקליזציה לפני חודשיים, נתתי עדיפות לשפות ש:",
    "lang_li1": "מתורגמות באופן לא מיטבי על ידי שירותי תרגום אלגוריתמיים מעידן טרום-הבינה המלאכותית, במיוחד בכל הנוגע לסוגי התוכן המלאים בז'רגון שיש לי באתר.",
    "lang_li2": "אני מכירה מספיק טוב כדי שאוכל לבדוק את העבודה של Gemini.",
    "lang_li3": "מושכות אותי מבחינה אסתטית ו/או פונולוגית.",
    "lang_p5": "אם שפה לא עמדה בכל שלושת הקריטריונים, נאלצתי לדלג עליה.",
    "lang_p6": "מנדרינית זה מדהים, אבל אני לא מכירה אותה בכלל.",
    "lang_p7": "ספרדית היא כנראה השפה השנייה הכי טובה שלי, אבל אני חושבת שגוגל טרנסלייט די טוב בה. נראה שהוא מתרגם בסדר גמור הלוך ושוב עם אנגלית.",
    "lang_p8": "לגבי נקודה 3, אני אוהבת את הצליל של השפות הרומאניות, אבל אני לא ממש חובבת שלהן מבחינה ויזואלית. לסיים יותר מדי מילים בתנועות בדרך כלל פשוט נראה לא נכון, מוזר.",
    "lang_p9": "זה לא אומר שלעולם לא אכלול ספרדית או מנדרינית, הן פשוט לא יכולות להיות בעדיפות עבורי כרגע.",
    "lang_h2_so-you-just-ask-ai-to-translate-the-pages-for-you": "אז פשוט לבקש מ-AI לתרגם את הדפים?",
    "lang_p10": "כן. ...ולא.",
    "lang_p11": "אמנם אני חושבת שלבקש מ-AI לעשות זאת ייתן לפעמים תוצאות טובות יותר מגוגל טרנסלייט, וסיפוק הפלט המוכן מראש הוא עדיין שיפור על פני בזבוז משאבי מחשוב, אני מוצאת ש-AI נוטה לכמה הרגלים רעים:",
    "lang_li4": "המבנה נשמר כמה שיותר ללא אובדן.",
    "lang_li5": "המשמעות הולכת לאיבוד כדי לשמר את המבנה.",
    "lang_p12": "במצב הזה, מפסידים מכל הכיוונים. מאבדים משמעות (במיוחד כשמדובר בז'רגון) אבל שומרים על התחביר והמבנה המקוריים של האנגלית.",
    "lang_p13": "לכן, ניסיתי לשלב כמה אסטרטגיות שהמצאתי עוד לפני עידן ה-AI.",
    "lang_li6": "לבנות רשימה של כל מונחי הז'רגון שאני חושבת שיהיה להם ערך בוויקיפדיה. (למשל <a href=\"https://he.wikipedia.org/wiki/כתב_תכוניתי\">כתב תכוניתי</a>).",
    "lang_li7": "למצוא את המונח המתאים בכל שפה. אם אין אותו בוויקיפדיה, אני מנסה לחפש בפורומים כדי למצוא דוברי שפת אם שדנים באותו מושג.",
    "lang_li8": "להראות ל-Gemini את החלק האנגלי של קובץ הלוקליזציה המתהווה ואת מונחי הז'רגון בשפות המתאימות להם, ואז לבקש ממנו להימנע מ\"תרגמזית\" (translatese), \"לעשות לוקליזציה, לא לתרגם\". לבקש שהפלט יהיה מפורמט כך שיתאים לקובץ ה-json הקיים.",
    "lang_li9": "להציג תצוגה מקדימה של ה-json בבלוג שלי באמצעות fiveserver, לבדוק שהז'רגון נכון ושאין שגיאות בוטות שמפריעות להבנה. לתקן שורות על בסיס כל מקרה לגופו.",
    "lang_li10": "להזין את ה-json המלא החדש ל-Gemini אחר, לבקש ממנו למצוא שגיאות שמפריעות להבנה או נשמעות מסורבלות ובכך מקשות על הקריאה, לבקש הסברים ושוב לתקן את החלקים הבעייתיים (במיוחד אם הוא רוצה לשנות את הז'רגון).",
    "lang_p14": "אני חושבת שלזה קוראים <abbr title=\"עריכה לאחר תרגום מכונה\">MTPE</abbr>.",
    "lang_p15": "ב-99% מהמקרים, Gemini טוב ממני בתרגום. לא יכולתי לעשות את זה בלעדיו, אבל הוא צריך הרבה עזרה בדרך. אני מרגישה שהתרגומים שלו עדיין מילוליים מדי, אבל יש לו אוצר מילים שאין לי, ואני חושבת שהוא מאפשר להציע תוכן מספיק נכון כדי שיהיה מובן, בניגוד לתרגום האוטומטי של גוגל טרנסלייט שמגיע עם דפדפני Chromium.",
    "lang_p16": "ממה שאני יכולה להגיד, התרגומים מרגישים קצת מסורבלים בכל שפה, אבל גם האנגלית שלי מסורבלת אז אולי הוא פשוט באמת מצליח לתפוס את הקול שלי.",
    "lang_p17": "אם אתם קוראים אחת מהשפות שהחלטתי לנסות להציע, אנא יידעו אותי איך אני יכולה לשפר את התרגומים.",
    "lang_h2_does-gemini-do-the-graflect-transliterations-too": "האם Gemini עושה גם את תעתיקי ה-Graflect?",
    "lang_p18": "כן. (שוב, עם הסתייגויות)",
    "lang_p19": "Gemini ממש קולט מהר את <a href=\"/blog/graflect.html\">Graflect</a>, אבל יש לו כמה מוזרויות.",
    "lang_p20": "לדוגמה, Gemini אוהב לכתוב במבטא בריטי. ברצינות. R לא רוטית (שבה ה-R אינה נהגית בסוף הברות), תנועות בסופי מילים במקום R. חיריק קצר ([ɪ]) במקום חיריק מלא ([iː]).",
    "lang_p21": "זה היה עקבי ביותר לאורך כל הניסיונות לגרום ל-Gemini להשתמש ב-Graflect.",
    "lang_p22": "הייתי מניחה שזה נבע מבעיה בטבלת ה-<abbr title=\"אלפבית פונטי בינלאומי\">IPA</abbr> שלי, אבל בכנות בשלב הזה אני פשוט מאמינה שככה הוא מדבר עכשיו.",
    "lang_p23": "הוא גם אוהב להשתמש בגליפים מסוימים מכתבים מומצאים אחרים, וזה ממש חמוד כי לעתים קרובות הוא יגניב את אותם הגליפים כדי להחליף את אותם גליפי Graflect אמיתיים. בהתחלה לא היה לי מושג למה זה קורה בכלל והאמנתי שזו איזושהי בעיה בצד שלי.",
    "lang_p24": "חבר שלי אהרון כתב סקריפט שאני משתמשת בו עכשיו ב-<abbr title=\"Visual Studio Code\">VSCode</abbr> שלי כדי לתפוס את אלה, ואז להתבכיין עליהם ל-Gemini. שום הנדסת פרומפטים מכל סוג שהוא עד כה לא הצליחה לגרום ל-Gemini להפסיק לכלול גליפים שאינם Graflect בפלטים שלו, מלבד פשוט להדביק את הודעת השגיאה ולתת לו הזדמנות לנסות שוב.",
    "lang_p25": "כדי לגרום ל-Gemini לכתוב במבטא שלי, הייתי צריכה לתעתק כמה קובצי לוקליזציה בעצמי קודם, (וכדי לעשות זאת יש לי כמה כלים כדי שאוכל לעשות זאת במהירות), אבל ברגע שהיה לו בסיס להתחיל ממנו הוא ממש הצליח יפה להשיל את המבטא הבריטי! כל הכבוד, Gemini!",
    "lang_p26": "כל פוסט בבלוג למעט זה של ה-<abbr title=\"אלפבית פונטי בינלאומי\">IPA</abbr> של Graflect אמור להיות 80%-99% Gemini, כמעט ללא שינויים. אני מופתעת שהוא הצליח להסיק כל כך הרבה ממה שסיפקתי. אם אתם סקרנים, נסו לראות אם אתם יכולים לזהות מוזרויות כלשהן שלא קיימות במבטא שלי. אני לא חושבת שתצליחו!",
    "lang_p27": "היה משהו ממש מגניב בלגרום ל-Gemini להישמע כמו יאנקי מקונטיקט, ואני שמחה שניסיתי את זה במקום פשוט לשכתב הכל ביד. אם אתם רוצים לנסות את זה בעצמכם, כוונו לכ-800-1200 מילים של טקסט לדוגמה. אני חושבת שזה כל מה ש-Gemini צריך כדי לקלוט מספיק אן-גרמים כדי להסיק את המבטא שלכם.",
    "lang_h2_should-everyone-do-this": "האם כולם צריכים לעשות את זה?",
    "lang_p28": "אה, אולי?",
    "lang_p29": "זה מאוד ברור למה בלוגים אישיים הם בדרך כלל חד-לשוניים, ואפילו רוב האתרים. כל דבר עם ניואנסים היה פעם מאוד גוזל זמן לתרגום, ורוב האנשים ממילא קוראים אנגלית. ואז, עם גוגל טרנסלייט, אפשר לקבל בערך את התמצית של כל מה שלא בלינגואה פרנקה העולמית, אז שוב, הרבה עבודה לחינם.",
    "lang_p30": "אני חושבת שהאתר שלי הוא אינדיקציה די ברורה לכך שסף הכניסה לעשות את זה נמוך מתמיד, אבל אני אהיה מאוד מופתעת אם בעוד שנה הדפדפנים שלנו לא יוכלו לעשות את זה בשידור חי ובעצמם. הם אולי אפילו ינסחו מחדש דברים באופן שתעדיפו. אומר זאת כך, עם <abbr title=\"מודלי שפה גדולים\">LLMs</abbr>, זה בעצם אפס עבודה לתרגם את הדף שלך ואתה זוכה לכוונן דברים באופן שלא היה אפשרי קודם, זה ממש מגניב לנסות.",
    "lang_h2_tldr": "תכל'ס",
    "lang_p31": "רציתי שיהיו אפשרויות שפה באתר שלי שישמרו על הז'רגון ויעבירו יותר מהקול שלי (במקרה של Graflect, פונולוגית). הקרדיט מגיע לגוגל ואחרים.",
    "lang_h2_postface-commentary": "הערות סיום",
    "lang_p32": "אני מוצאת של-Graflect יש כמה קשיים, למשל, אני אומרת \"\" במשפט \"\".",
    "lang_p33": "הצליל \"A ב-Accent\" אינו מתמשך, אז זה לא נשמע כמו מבטא בריטי, זה בעצם נשמע רגיל כי הוא קצר.",
    "lang_p34": "אם אני אומרת can בפני עצמה, או בהקשרים מסוימים כמו תשובה \"I can.\" למישהו, A הופכת ל-.",
    "lang_p35": "אז אני לא חושבת שזה ייצוג מושלם של איך שהייתי מדברת, אבל זה קירוב טוב יותר ממה שהכתב הלטיני הפשוט יכול לתת."
  },
  "ru": {
    "win_gallerynav_title": "◈ Навигация.язык",
    "lang_nav_title": "Локализация!",
    "lang_nav_you-deliberately-left-out-my-language": "Серьёзно?",
    "lang_nav_so-you-just-ask-ai-to-translate-the-pages-for-you": "Как?",
    "lang_nav_does-gemini-do-the-graflect-transliterations-too": "Транслитерация Graflect",
    "lang_nav_should-everyone-do-this": "Стоит ли вам это делать?",
    "lang_nav_tldr": "TL;DR",
    "lang_nav_postface-commentary": "Послесловие",
    "gt_nav_h2_home": "⌂←",
    "lang_win_gallery_title": "▤ Статья.язык",
    "lang_title": "Этот блог теперь поддерживает ваш язык",
    "lang_p1": "Ну, есть шанс, что нет.",
    "lang_p2": "На самом деле, поскольку этот блог намеренно не доступен на мандаринском, испанском, хинди или арабском, этот шанс довольно велик.",
    "lang_h2_you-deliberately-left-out-my-language": "Вы намеренно исключили мой язык?",
    "lang_p3": "Да.",
    "lang_p4": "Когда я добавила опцию локализации два месяца назад, я отдала приоритет тем языкам, которые:",
    "lang_li1": "Переводятся неоптимально с помощью до-ИИ алгоритмических сервисов перевода, особенно в отношении контента, наполненного жаргоном, как на моей странице.",
    "lang_li2": "Я достаточно хорошо знаю, чтобы иметь возможность проверять работу Gemini.",
    "lang_li3": "Привлекают меня эстетически и/или фонологически.",
    "lang_p5": "Если язык не соответствовал всем трем критериям, мне приходилось его пропускать.",
    "lang_p6": "Мандаринский — потрясающий, но я с ним совсем не знакома.",
    "lang_p7": "Испанский, вероятно, мой второй лучший язык, но я думаю, что Google Translate довольно хорошо с ним справляется. Кажется, он прилично переводит туда-сюда с английского.",
    "lang_p8": "Что касается пункта 3, я люблю звучание романских языков, но визуально они мне не очень нравятся. Когда слишком много слов оканчиваются на гласные, это создаёт ощущение чего-то неправильного, даже странного.",
    "lang_p9": "Это не значит, что я никогда не включу испанский или мандаринский, просто сейчас они не могут быть для меня в приоритете.",
    "lang_h2_so-you-just-ask-ai-to-translate-the-pages-for-you": "Так вы просто просите ИИ переводить страницы для вас?",
    "lang_p10": "Да. ...и нет.",
    "lang_p11": "Хотя я думаю, что просьба к ИИ сделать это иногда дала бы лучшие результаты, чем Google Translate, и предоставление заранее подготовленного вывода все же является улучшением по сравнению с тратой вычислительных ресурсов, я нахожу, что ИИ тяготеет к некоторым вредным привычкам:",
    "lang_li4": "Структура сохраняется максимально без потерь.",
    "lang_li5": "Смысл теряется в угоду сохранения структуры.",
    "lang_p12": "Это самый неудачный вариант, сочетающий недостатки обоих подходов. Вы теряете смысл (особенно когда дело доходит до жаргона), но сохраняете исходный английский синтаксис и структуру.",
    "lang_p13": "Поэтому я попыталась применить некоторые стратегии, которые я придумала еще до появления ИИ.",
    "lang_li6": "Составить список любых жаргонных терминов, у которых, как я думаю, должна быть страница в Википедии. (Например, <a href=\"https://ru.wikipedia.org/wiki/Признаковое_письмо\">Признаковое письмо</a>).",
    "lang_li7": "Найти соответствующий термин в каждом языке. Если в Википедии его нет, я пытаюсь искать на форумах, чтобы найти носителей языка, обсуждающих ту же концепцию.",
    "lang_li8": "Показать Gemini английскую часть находящегося в разработке файла локализации и жаргонные термины на их соответствующих языках, затем попросить его «избегать „переводянки“», «локализовать, а не переводить». Попросить отформатировать это так, чтобы оно вписалось в существующий json.",
    "lang_li9": "Предварительно просмотреть json в моем блоге с помощью fiveserver, проверить, что жаргон правильный и что нет вопиющих ошибок, мешающих пониманию. Исправлять строки в каждом конкретном случае.",
    "lang_li10": "Подать новый полный json другому Gemini, попросить его найти ошибки, которые мешают пониманию или звучат неловко и, следовательно, затрудняют чтение, попросить объяснений и снова исправить вопиющие части (особенно если он хочет изменить жаргон).",
    "lang_p14": "Кажется, это называется <abbr title=\"Постредактирование машинного перевода\">MTPE</abbr>.",
    "lang_p15": "В 99% случаев Gemini переводит лучше меня. Я не смогла бы сделать это без него, но ему нужна большая помощь в процессе. Мне кажется, что его переводы все еще слишком буквальны, но у него есть словарный запас, которого у меня нет, и я думаю, он позволяет предлагать контент, который достаточно корректен, чтобы его можно было понять, в отличие от автоматического Google Translate, поставляемого с браузерами на основе Chromium.",
    "lang_p16": "Насколько я могу судить, переводы кажутся несколько неловкими на каждом языке, но мой английский тоже неловок, так что, возможно, он просто действительно уловил мой стиль.",
    "lang_p17": "Если вы можете читать на любом из языков, которые я решила попытаться предложить, пожалуйста, дайте мне знать, как я могу улучшить переводы.",
    "lang_h2_does-gemini-do-the-graflect-transliterations-too": "Gemini делает и транслитерацию Graflect?",
    "lang_p18": "Да. (опять же, с оговорками)",
    "lang_p19": "Gemini очень быстро осваивает <a href=\"/blog/graflect.html\">Graflect</a>, но у него есть несколько причуд.",
    "lang_p20": "Например, Gemini любит писать с британским акцентом. Серьезно. Неротическое произношение (r не произносится на конце слога), гласные в конце слов вместо «R». Краткое [ɪ] вместо долгого [iː].",
    "lang_p21": "Это было чрезвычайно последовательно на протяжении всего времени, когда я заставляла Gemini использовать Graflect.",
    "lang_p22": "Я бы предположила, что это произошло в результате проблемы с моей таблицей <abbr title=\"Международный фонетический алфавит\">МФА</abbr>, но, честно говоря, на данном этапе я просто верю, что он теперь так говорит.",
    "lang_p23": "Он также любит использовать определенные глифы из других искусственных письменностей, что очень мило, так как он часто протаскивает одни и те же, чтобы заменить одни и те же настоящие глифы Graflect. Сначала я понятия не имела, почему это вообще происходит, и считала, что это какая-то проблема с моей стороны.",
    "lang_p24": "Мой друг Аарон написал скрипт, который я теперь использую в своем <abbr title=\"Visual Studio Code\">VSCode</abbr>, чтобы отлавливать их, а затем ныть об этом Gemini. Пока что никакая инженерия промптов не смогла заставить Gemini прекратить включать в свои выводы глифы, не относящиеся к Graflect, кроме как просто вставить оповещение о проблеме и дать ему шанс попробовать еще раз.",
    "lang_p25": "Чтобы заставить Gemini писать с моим акцентом, мне пришлось сначала транслитерировать несколько файлов локализации (а для этого у меня есть несколько инструментов, чтобы делать это быстро), но как только у него появилась основа для работы, он действительно отлично справился с избавлением от британского акцента! Молодец, Gemini!",
    "lang_p26": "Каждый пост в блоге, за исключением поста о <abbr title=\"Международный фонетический алфавит\">МФА</abbr> Graflect, должен быть на 80%-99% от Gemini, прямо из коробки. Я удивлена, что он смог так много вывести из того немногого, что я предоставила. Если вам интересно, попробуйте найти какие-нибудь странности, которых нет в моём собственном произношении. Не думаю, что у вас получится!",
    "lang_p27": "Было что-то действительно крутое в том, чтобы заставить Gemini звучать как янки из Коннектикута, и я рада, что попробовала это, вместо того чтобы просто переписывать все вручную. Если вы хотите попробовать это сами, нацельтесь примерно на 800-1200 слов образцового текста. Я думаю, этого Gemini достаточно, чтобы уловить достаточно n-грамм для вывода вашего акцента.",
    "lang_h2_should-everyone-do-this": "Стоит ли всем это делать?",
    "lang_p28": "Э-э, может быть?",
    "lang_p29": "Совершенно очевидно, почему личные блоги обычно одноязычны, даже большинство веб-сайтов. Раньше перевод чего-либо с нюансами отнимал очень много времени, и большинство все равно умеет читать по-английски. Затем, с помощью Google Translate, вы можете как бы уловить суть всего, что не на глобальной лингва-франка, так что опять же, много работы впустую.",
    "lang_p30": "Я думаю, мой веб-сайт является довольно ясным указанием на то, что порог вхождения в это дело стал смехотворно низким, но я буду очень удивлена, если через год наши браузеры не смогут делать это в реальном времени и самостоятельно. Они могут даже перефразировать вещи так, как вы предпочитаете. Скажу так, с <abbr title=\"Большие языковые модели\">LLM</abbr> перевод вашей страницы практически не требует усилий, и вы можете тонко настраивать вещи так, как это было невозможно раньше, это действительно круто попробовать.",
    "lang_h2_tldr": "Короче",
    "lang_p31": "Я хотела иметь на своем веб-сайте языковые опции, которые сохраняли бы жаргон и передавали больше моего голоса (в случае с Graflect, фонологически). Заслуга принадлежит Google и другим.",
    "lang_h2_postface-commentary": "Послесловие",
    "lang_p32": "Я нахожу, что с Graflect есть некоторые трудности, например, я говорю «» в предложении «».",
    "lang_p33": "Звук «A в Accent» не протяжный, поэтому он не звучит как британский акцент, на самом деле он звучит нормально, потому что он короткий.",
    "lang_p34": "Если я говорю can само по себе или в определенных контекстах, например, отвечая «I can.» кому-то, A становится .",
    "lang_p35": "Так что я не думаю, что это идеальное представление того, как я бы говорила, но это более близкое приближение, чем может дать простая латиница."
  },
  "de": {
    "win_gallerynav_title": "◈ Navigation.Sprache",
    "lang_nav_title": "Lokalisierung!",
    "lang_nav_you-deliberately-left-out-my-language": "Wirklich?",
    "lang_nav_so-you-just-ask-ai-to-translate-the-pages-for-you": "Wie?",
    "lang_nav_does-gemini-do-the-graflect-transliterations-too": "Graflect-Transliterationen",
    "lang_nav_should-everyone-do-this": "Sollten Sie das auch tun?",
    "lang_nav_tldr": "TL;DR",
    "lang_nav_postface-commentary": "Nachwort",
    "gt_nav_h2_home": "⌂←",
    "lang_win_gallery_title": "▤ Artikel.Sprache",
    "lang_title": "Dieser Blog unterstützt jetzt Ihre Sprache",
    "lang_p1": "Okay, es besteht die Möglichkeit, dass er das nicht tut.",
    "lang_p2": "Tatsächlich, da dieser Blog absichtlich nicht auf Mandarin, Spanisch, Hindi oder Arabisch verfügbar ist, ist die Chance ziemlich groß.",
    "lang_h2_you-deliberately-left-out-my-language": "Du hast meine Sprache absichtlich weggelassen?",
    "lang_p3": "Ja.",
    "lang_p4": "Als ich vor zwei Monaten die Lokalisierungsoption hinzugefügt habe, habe ich Sprachen priorisiert, die:",
    "lang_li1": "durch algorithmische Übersetzungsdienste aus der Vor-KI-Zeit suboptimal übersetzt werden, insbesondere im Hinblick auf die Art von jargonreichen Inhalten auf meiner Seite.",
    "lang_li2": "Ich gut genug kenne, um die Arbeit von Gemini überprüfen zu können.",
    "lang_li3": "Mich ästhetisch und/oder phonologisch ansprechen.",
    "lang_p5": "Wenn eine Sprache nicht alle drei Kriterien erfüllte, musste ich sie überspringen.",
    "lang_p6": "Mandarin ist großartig, aber ich kenne mich damit überhaupt nicht aus.",
    "lang_p7": "Spanisch ist wahrscheinlich meine zweitbeste Sprache, aber ich denke, Google Translate ist ziemlich gut darin. Es scheint anständig hin und her mit Englisch zu übersetzen.",
    "lang_p8": "Was Punkt 3 betrifft, so liebe ich den Klang romanischer Sprachen, aber optisch bin ich kein großer Fan von ihnen. Wenn zu viele Wörter auf einen Vokal enden, sieht das meistens einfach falsch oder seltsam aus.",
    "lang_p9": "Das soll nicht heißen, dass ich Spanisch oder Mandarin nie einbeziehen werde, sie können für mich nur keine Priorität haben.",
    "lang_h2_so-you-just-ask-ai-to-translate-the-pages-for-you": "Du bittest also einfach eine KI, die Seiten für dich zu übersetzen?",
    "lang_p10": "Ja. ...und nein.",
    "lang_p11": "Obwohl ich denke, dass eine KI manchmal bessere Ergebnisse liefern würde als Google Translate und die Bereitstellung des vorgefertigten Ergebnisses immer noch eine Verbesserung gegenüber der Verschwendung von Rechenleistung darstellt, stelle ich fest, dass KI zu einigen schlechten Angewohnheiten neigt:",
    "lang_li4": "Die Struktur ist so verlustfrei wie möglich.",
    "lang_li5": "Die Bedeutung geht verloren, um die Struktur zu erhalten.",
    "lang_p12": "Man bekommt nur die Nachteile von beidem. Man verliert Bedeutung (besonders bei Jargon), behält aber die ursprüngliche englische Syntax und Struktur bei.",
    "lang_p13": "Deshalb habe ich versucht, einige Strategien einzubeziehen, die ich mir vor der KI ausgedacht habe.",
    "lang_li6": "Eine Liste von Jargon-Begriffen erstellen, von denen ich denke, dass sie eine Wikipedia-Seite haben könnten. (Z.B. <a href=\"https://de.wikipedia.org/wiki/Merkmalschrift\">Merkmalschrift</a>).",
    "lang_li7": "Den passenden Begriff in jeder Sprache finden. Wenn Wikipedia ihn nicht hat, versuche ich, in Foren nach Muttersprachlern zu suchen, die dasselbe Konzept diskutieren.",
    "lang_li8": "Gemini den englischen Teil der in Arbeit befindlichen Lokalisierungsdatei und die Jargon-Begriffe in ihren jeweiligen Sprachen zeigen und ihn dann bitten, „Übersetzerdeutsch“ zu vermeiden, „lokalisieren, nicht übersetzen“. Bitten, es so zu formatieren, dass es in das vorhandene JSON passt.",
    "lang_li9": "Das JSON in meinem Blog mit dem Fiveserver-Plugin vorab ansehen, überprüfen, ob der Jargon korrekt ist und es keine groben Fehler gibt, die das Verständnis behindern. Zeilen von Fall zu Fall korrigieren.",
    "lang_li10": "Das neue vollständige JSON einem anderen Gemini geben, ihn bitten, Fehler zu finden, die das Verständnis behindern oder die umständlich klingen und das Lesen erschweren, um Erklärungen bitten und die groben Teile erneut korrigieren (insbesondere wenn er den Jargon ändern möchte).",
    "lang_p14": "Ich glaube, das nennt man <abbr title=\"Maschinelle Übersetzung mit Post-Editing\">MTPE</abbr>.",
    "lang_p15": "In 99 % der Fälle ist Gemini besser im Übersetzen als ich. Ohne ihn könnte ich das nicht tun, aber man muss ihm dabei unter die Arme greifen. Ich habe das Gefühl, seine Übersetzungen sind immer noch sehr wörtlich, aber er hat einen Wortschatz, der mir fehlt, und ich denke, er macht es möglich, Inhalte anzubieten, die korrekt genug sind, um verstanden zu werden, im Gegensatz zum automatischen Google Translate, das mit Chromium-Browsern geliefert wird.",
    "lang_p16": "Soweit ich das beurteilen kann, fühlen sich die Übersetzungen in jeder Sprache etwas umständlich an, aber mein Englisch ist auch umständlich, also vielleicht ist es ein Fall, in dem er wirklich meine Stimme einfängt.",
    "lang_p17": "Wenn du eine der Sprachen lesen kannst, die ich anzubieten versuche, lass mich bitte wissen, wie ich die Übersetzungen verbessern kann.",
    "lang_h2_does-gemini-do-the-graflect-transliterations-too": "Macht Gemini auch die Graflect-Transliterationen?",
    "lang_p18": "Ja. (wieder mit Vorbehalten)",
    "lang_p19": "Gemini lernt <a href=\"/blog/graflect.html\">Graflect</a> wirklich schnell, aber er hat ein paar Eigenheiten.",
    "lang_p20": "Zum Beispiel schreibt Gemini gerne mit einem britischen Akzent. Ernsthaft. Nicht-rhotische R-Laute (wobei das 'r' am Silbenende nicht ausgesprochen wird), Vokale am Ende von Wörtern anstelle von Rs. Kurzes [ɪ] statt langem [iː].",
    "lang_p21": "Das war extrem konsistent, während ich Gemini dazu brachte, Graflect zu verwenden.",
    "lang_p22": "Ich würde annehmen, dass das von einem Problem mit meiner <abbr title=\"Internationales Phonetisches Alphabet\">IPA</abbr>-Tabelle kam, aber ehrlich gesagt glaube ich an diesem Punkt einfach, dass er jetzt so spricht.",
    "lang_p23": "Er verwendet auch gerne bestimmte Glyphen aus anderen konstruierten Schriften, was wirklich bezaubernd ist, da er oft dieselben einschmuggelt, um dieselben tatsächlichen Graflect-Glyphen zu ersetzen. Anfangs hatte ich keine Ahnung, warum das überhaupt passierte, und glaubte, es sei irgendein Problem auf meiner Seite.",
    "lang_p24": "Mein Freund Aaron hat ein Skript geschrieben, das ich jetzt in meinem <abbr title=\"Visual Studio Code\">VSCode</abbr> verwende, um diese abzufangen und mich dann bei Gemini darüber zu beschweren. Bisher hat kein Prompt-Engineering jeglicher Art Gemini dazu gebracht, aufzuhören, Nicht-Graflect-Glyphen in seine Ausgaben aufzunehmen, außer einfach die Problemmeldung einzufügen und ihm eine Chance zu geben, es erneut zu versuchen.",
    "lang_p25": "Um Gemini dazu zu bringen, in meinem Akzent zu schreiben, musste ich zuerst einige Lokalisierungsdateien transkribieren (und dafür habe ich ein paar Werkzeuge, damit ich das schnell erledigen kann), aber als er eine Grundlage hatte, von der er ausgehen konnte, hat er den britischen Akzent wirklich gut abgelegt! Klasse, Gemini!",
    "lang_p26": "Jeder Blogbeitrag außer dem über das Graflect-<abbr title=\"Internationales Phonetisches Alphabet\">IPA</abbr> sollte zu 80 %-99 % von Gemini stammen, direkt aus der Box. Ich bin überrascht, dass er aus dem Wenigen, was ich ihm gegeben habe, so viel ableiten konnte. Wenn du neugierig bist, versuche doch mal, irgendwelche Seltsamkeiten zu finden, die es in meinem eigenen Akzent nicht gibt. Ich glaube nicht, dass du das schaffst!",
    "lang_p27": "Es war etwas wirklich Cooles, Gemini dazu zu bringen, wie ein Yankee aus Connecticut zu klingen, und ich bin froh, dass ich das ausprobiert habe, anstatt alles von Hand neu zu schreiben. Wenn du das selbst ausprobieren möchtest, peile etwa 800-1200 Wörter als Beispieltext an. Ich denke, das ist alles, was Gemini braucht, um genügend N-Gramme aufzunehmen, um deinen Akzent abzuleiten.",
    "lang_h2_should-everyone-do-this": "Sollte jeder das tun?",
    "lang_p28": "Äh, vielleicht?",
    "lang_p29": "Es ist sehr offensichtlich, warum persönliche Blogs normalerweise einsprachig sind, sogar die meisten Websites sind es. Alles mit Nuancen war früher sehr zeitaufwändig zu übersetzen, und die meisten können sowieso Englisch lesen. Dann, mit Google Translate, kann man irgendwie den Kern von allem erfassen, was nicht in der globalen Lingua Franca ist, also wieder viel Arbeit für keinen Lohn.",
    "lang_p30": "Ich denke, meine Website ist ein ziemlich klares Indiz dafür, dass die Eintrittshürde dafür jetzt im Keller ist, aber ich wäre sehr überrascht, wenn unsere Browser das in einem weiteren Jahr nicht live und von sich aus könnten. Sie könnten die Dinge sogar so umformulieren, wie du es bevorzugst. Ich sage dies, mit <abbr title=\"Große Sprachmodelle\">LLMs</abbr> ist es im Grunde keine Arbeit, deine Seite zu übersetzen, und du kannst die Dinge auf eine Weise feinabstimmen, die vorher nicht möglich war, es ist wirklich cool, es auszuprobieren.",
    "lang_h2_tldr": "TL;DR",
    "lang_p31": "Ich wollte Sprachoptionen auf meiner Website haben, die den Jargon bewahren und mehr von meiner Stimme vermitteln (im Fall von Graflect, phonologisch). Google et al. gebührt die Anerkennung.",
    "lang_h2_postface-commentary": "Nachwort",
    "lang_p32": "Ich finde, Graflect hat einige Schwierigkeiten, zum Beispiel sage ich „“ im Satz „“.",
    "lang_p33": "Der „A in Accent“-Laut wird nicht gehalten, also klingt es nicht britisch, sondern ganz normal, weil es kurz ist.",
    "lang_p34": "Wenn ich „can“ allein sage oder in bestimmten Kontexten wie der Antwort „I can.“ auf jemanden, wird A zu .",
    "lang_p35": "Also denke ich nicht, dass es eine perfekte Darstellung davon ist, wie ich sprechen würde, aber es ist eine nähere Annäherung, als es einfaches Latein geben kann."
  },
  "ja": {
    "win_gallerynav_title": "◈ ナビ.言語",
    "lang_nav_title": "ローカリゼーション！",
    "lang_nav_you-deliberately-left-out-my-language": "本気で？",
    "lang_nav_so-you-just-ask-ai-to-translate-the-pages-for-you": "どうやって？",
    "lang_nav_does-gemini-do-the-graflect-transliterations-too": "Graflectの翻字",
    "lang_nav_should-everyone-do-this": "みんなもやるべき？",
    "lang_nav_tldr": "要約",
    "lang_nav_postface-commentary": "あとがき",
    "gt_nav_h2_home": "⌂←",
    "lang_win_gallery_title": "▤ 記事.言語",
    "lang_title": "このブログが、あなたの言語をサポートするようになりました",
    "lang_p1": "まあ、そうじゃない可能性もありますけどね。",
    "lang_p2": "実際、このブログは意図的に標準中国語、スペイン語、ヒンディー語、アラビア語に対応していないので、その可能性はかなり高いです。",
    "lang_h2_you-deliberately-left-out-my-language": "私の言語を意図的に除外したってこと？",
    "lang_p3": "はい。",
    "lang_p4": "2ヶ月前にローカリゼーションの選択肢を追加したとき、私が優先したのは次のような言語です：",
    "lang_li1": "AI以前のアルゴリズム翻訳サービスでは最適とは言えない翻訳がされる言語。特に私のページにあるような専門用語だらけのコンテンツに関しては。",
    "lang_li2": "私がGeminiの仕事ぶりをチェックできる程度には詳しい言語。",
    "lang_li3": "美的、あるいは音声学的に私にとって魅力的な言語。",
    "lang_p5": "ある言語がこれら3つの基準をすべて満たさなかった場合、私はそれをスキップせざるを得ませんでした。",
    "lang_p6": "標準中国語は素晴らしいですが、私は全く詳しくありません。",
    "lang_p7": "スペイン語はたぶん私の2番目に得意な言語ですが、Google翻訳はかなり優秀だと思います。英語との間でそこそこまともに翻訳してくれるようですし。",
    "lang_p8": "3番目の点については、ロマンス諸語の響きは大好きですが、見た目はあまり好きじゃないんです。母音で終わる単語が多すぎると、たいてい何か変な感じがしてしまいます。",
    "lang_p9": "だからといって、スペイン語や標準中国語を絶対に追加しないというわけではありません。ただ、今の私にとって優先事項にはできないというだけです。",
    "lang_h2_so-you-just-ask-ai-to-translate-the-pages-for-you": "じゃあ、AIにページを翻訳してもらうだけ？",
    "lang_p10": "はい。…そして、いいえ。",
    "lang_p11": "AIに頼めばGoogle翻訳より良い結果が得られることもあると思いますし、事前に用意された出力を提供するだけでも計算資源の無駄遣いを省く改善にはなりますが、AIにはいくつかの悪い癖に引き寄せられる傾向があることに気づきました：",
    "lang_li4": "構造は可能な限り損失なく維持される。",
    "lang_li5": "意味は構造を維持するために犠牲にされる。",
    "lang_p12": "これは最悪のパターンですね。意味を失い（特に専門用語に関して）、でも元の英語の構文と構造は維持されるのですから。",
    "lang_p13": "そこで、AIが登場する前に考え出した戦略をいくつか取り入れてみました。",
    "lang_li6": "ウィキペディアにページがありそうな専門用語のリストを作成する。（例：<a href=\"https://ja.wikipedia.org/wiki/素性文字\">素性文字</a>）。",
    "lang_li7": "各言語で適切な用語を見つける。ウィキペディアになければ、掲示板やコミュニティなどを検索して、同じ概念について議論しているネイティブスピーカーを見つけようと試みる。",
    "lang_li8": "Geminiに、作業中のローカリゼーションファイルの英語版と、それぞれの言語での専門用語を見せて、「翻訳調を避けて」「翻訳ではなく、ローカライズして」と頼む。既存のjsonに収まるようにフォーマットしてもらうよう頼む。",
    "lang_li9": "fiveserverを使ってブログでjsonをプレビューし、専門用語が正しいこと、理解を妨げるようなひどいエラーがないことを確認する。行ごとにケースバイケースで修正する。",
    "lang_li10": "新しい完全なjsonを別のGeminiに渡し、理解を妨げたり、不自然に聞こえて読みにくくしたりするエラーを見つけるように頼み、説明を求めて、またひどい部分を修正する（特に彼が専門用語を変更したがる場合）。",
    "lang_p14": "これは<abbr title=\"機械翻訳後編集\">MTPE</abbr>と呼ばれているものだと思います。",
    "lang_p15": "99%の場合、Geminiは私より翻訳が上手です。彼なしではこれはできませんでしたが、うまく使うにはコツが要ります。彼の翻訳はまだ非常に直訳調な感じがしますが、私にはない語彙を持っていますし、Chromiumベースのブラウザに搭載されている自動のGoogle翻訳とは違って、理解できるほど正しいコンテンツを提供することを可能にしてくれると思います。",
    "lang_p16": "私が知る限り、翻訳はどの言語でも少し不自然に感じられますが、私の英語も不自然なので、もしかしたら彼が私の文体をうまく拾っているのかもしれません。",
    "lang_p17": "もし私が提供しようと決めた言語のいずれかを読める方がいらっしゃいましたら、翻訳をどう改善できるか教えてください。",
    "lang_h2_does-gemini-do-the-graflect-transliterations-too": "GeminiはGraflectの翻字もやるの？",
    "lang_p18": "はい。（これもまた、注意点付きで）",
    "lang_p19": "Geminiは<a href=\"/blog/graflect.html\">Graflect</a>をすぐに習得してくれますが、いくつか癖があります。",
    "lang_p20": "例えば、Geminiはイギリス英語のアクセントで書くのが好きなんです。本当に。非ローティック（non-rhotic）なR（音節末のrを発音しない）、単語の最後のRの代わりに母音。短い [ɪ] の代わりに長い [iː]。",
    "lang_p21": "これはGeminiにGraflectを使わせている間、非常に一貫していました。",
    "lang_p22": "私の<abbr title=\"国際音声記号\">IPA</abbr>チャートに問題があった結果だと思いますが、正直なところ、今ではもう彼がそういう話し方なんだと信じています。",
    "lang_p23": "彼は他の人工文字から特定のグリフを使うのも好きで、それは本当にかわいいです。なぜなら、同じ実際のGraflectグリフを置き換えるために、同じものをこっそり入れてくることがよくあるからです。最初はなぜそんなことが起こるのか全く分からず、自分の側の何らかの問題だと思っていました。",
    "lang_p24": "友人のアーロンが作ったスクリプトを今<abbr title=\"Visual Studio Code\">VSCode</abbr>で使ってこれらを検出し、それについてGeminiに文句を言っています。これまでのところ、どんな種類のプロンプトエンジニアリングも、問題のアラートを貼り付けてもう一度試す機会を与える以外に、Geminiが出力にGraflect以外のグリフを含めるのをやめさせることはできませんでした。",
    "lang_p25": "Geminiに私のアクセントで書いてもらうために、まずいくつかのローカリゼーションファイルを翻字する必要がありました（そして、そのために高速で作業できるツールがいくつかあります）。しかし、彼が参考にするベースラインを掴んでからは、本当に見事にイギリス英語のアクセントを捨ててくれました。お見事、Gemini！",
    "lang_p26": "Graflectの<abbr title=\"国際音声記号\">IPA</abbr>に関するブログ投稿を除けば、すべてのブログ投稿は80%～99%がGeminiによるもので、すぐに使える状態です。私が提供したわずかな情報から、彼がこれほど多くを推測できたことに驚いています。もし興味があれば、私のアクセントには存在しない奇妙な点を見つけられるか試してみてください。見つけられないと思いますよ！",
    "lang_p27": "Geminiにコネチカットのヤンキーのように話させるのは、本当にクールなことでした。すべてを手で書き直す代わりにそれを試してみてよかったです。もしご自身でこれを試してみたいなら、800～1200語程度のサンプルテキストを目指してみてください。Geminiがあなたのアクセントを推測するのに十分なn-gramを拾うには、それで十分だと思います。",
    "lang_h2_should-everyone-do-this": "誰もがこれをやるべきか？",
    "lang_p28": "うーん、どうでしょう？",
    "lang_p29": "個人のブログが通常単一言語である理由は非常に明白で、ほとんどのウェブサイトでさえそうです。ニュアンスのあるものは翻訳に非常に時間がかかりましたし、ほとんどの人はとにかく英語が読めます。そして、Google翻訳を使えば、世界の共通語でないものでも大体の意味はつかめるので、結局、割に合わない作業なのです。",
    "lang_p30": "私のサイトは、この種のことを行う参入障壁が極めて低くなったことを示す良い例だと思います。でも、あと1年もすればブラウザ自体がリアルタイムでこれをこなせるようになっても、もはや驚きはないでしょうね。好みに合わせて言い回しを変えてくれる機能まで付くかもしれません。一つ言えるのは、<abbr title=\"大規模言語モデル\">LLM</abbr>のおかげで、ページの翻訳は実質的に手間いらずになり、以前は不可能だった方法で微調整できるようになった、ということです。試してみる価値はありますよ。",
    "lang_h2_tldr": "要するに",
    "lang_p31": "私は自分のウェブサイトに、専門用語を保持し、私の声をより多く伝える（Graflectの場合は音声学的に）言語オプションを持たせたかったのです。その功績はGoogleなどにあります。",
    "lang_h2_postface-commentary": "あとがき",
    "lang_p32": "Graflectにはいくつか難しい点があることに気づきました。例えば、私は「」という文の中で「」と言います。",
    "lang_p33": "「AccentのA」の音は持続しないので、イギリス英語のアクセントのようには聞こえず、短いので実際には普通に聞こえます。",
    "lang_p34": "もし私がcanを単独で、あるいは誰かに「I can.」と答えるような特定の文脈で言うと、Aはになります。",
    "lang_p35": "ですから、これが私の話し方を完璧に表現しているとは思いませんが、普通のラテン文字が与えることができるものよりは、より近い近似値です。"
  },
  "gt": {
    "win_gallerynav_title": "◈ lang.nav",
    "lang_nav_title": "!",
    "lang_nav_you-deliberately-left-out-my-language": "?",
    "lang_nav_so-you-just-ask-ai-to-translate-the-pages-for-you": "?",
    "lang_nav_does-gemini-do-the-graflect-transliterations-too": " ",
    "lang_nav_should-everyone-do-this": "   ?",
    "lang_nav_tldr": "TL;DR",
    "lang_nav_postface-commentary": " ",
    "gt_nav_h2_home": "⌂←",
    "lang_win_gallery_title": "▤ lang.article",
    "lang_title": "     ",
    "lang_p1": ",     .",
    "lang_p2": " ,         Mandarin, Spanish, Hindi,  Arabic,     .",
    "lang_h2_you-deliberately-left-out-my-language": "     ?",
    "lang_p3": ".",
    "lang_p4": "        ,    :",
    "lang_li1": " -  pre-ai   ,        -     .",
    "lang_li2": "          Gemini's .",
    "lang_li3": "    / .",
    "lang_p5": "        ,     .",
    "lang_p6": "Mandarin  ,         .",
    "lang_p7": "Spanish      ,    Google Translate     .          .",
    "lang_p8": "   3,      romance ,         .          , .",
    "lang_p9": "        Spanish  Mandarin,        .",
    "lang_h2_so-you-just-ask-ai-to-translate-the-pages-for-you": "    AI      ?",
    "lang_p10": ". ... .",
    "lang_p11": "    AI          Google Translate,    -        ,   AI     :",
    "lang_li4": "     .",
    "lang_li5": "        .",
    "lang_p12": "       .    (     )        .",
    "lang_p13": ",            AI.",
    "lang_li6": "             Wikipedia . (E.G.<a href=\"https://en.wikipedia.org/wiki/Featural_writing_system\">Featurality</a>).",
    "lang_li7": "      .  Wikipedia   ,             .",
    "lang_li8": " Gemini      -          ,     \" \", \",  \".          json.",
    "lang_li9": "  json     fiveserver,                .     -- .",
    "lang_li10": "    json   Gemini,                  ,          (       ).",
    "lang_p14": "     <abbr title=\"Machine Translation Post-Editing\">MTPE</abbr>.",
    "lang_p15": "99%   , Gemini      .       ,          .         1:1,      ,                 ,    Google Translate   Chromium .",
    "lang_p16": "    ,        ,                 .",
    "lang_p17": "             ,          .",
    "lang_h2_does-gemini-do-the-graflect-transliterations-too": " Gemini     ?",
    "lang_p18": ". (,  )",
    "lang_p19": "Gemini    <a href=\"/blog/graflect.html\"></a> ,      .",
    "lang_p20": " , Gemini       . . - Rs,         Rs.  I    E.",
    "lang_p21": "       Gemini  .",
    "lang_p22": "             <abbr title=\"International Phonetic Alphabet\">IPA</abbr> ,             .",
    "lang_p23": "          ,                     .                      .",
    "lang_p24": "  Aaron         <abbr title=\"Visual Studio Code\">VSCode</abbr>   ,     Gemini  .             Gemini    -    ,               .",
    "lang_p25": "    Gemini     ,          , (               ),                  !    Gemini!",
    "lang_p26": "      <abbr title=\"International Phonetic Alphabet\">IPA</abbr>    80%-99% Gemini,     .              .   ,                .     !",
    "lang_p27": "       Gemini     Connecticut Yankee,               .        ,    800-1200    .     Gemini       n-grams    .",
    "lang_h2_should-everyone-do-this": "   ?",
    "lang_p28": ", ?",
    "lang_p29": "        ,    .        -  ,       . ,  Google Translate,              Lingua Franca,  ,      .",
    "lang_p30": "                     ,                    .          .    ,  <abbr title=\"Large Language Models\">LLMs</abbr>,             -        ,     .",
    "lang_h2_tldr": "TL;DR",
    "lang_p31": "                  (    , ). Google et al   .",
    "lang_h2_postface-commentary": " ",
    "lang_p32": "     ,  ,   \"\"    \"\".",
    "lang_p33": " \"A in Accent\"    ,        ,       .",
    "lang_p34": "   can   ,       \"I can.\"  , A  .",
    "lang_p35": "           ,        Latin  ."
  }
}
