{
  "en": {
    "sunshine_title": "Sunshine Experimental Keyboard",
    "win_gallerynav_title": "◈ article.nav",
    "sun_win_gallery_title": "▤ sunshine.article",
    "nav_h2_tldr": "Abstract",
    "nav_h2_intro": "Background",
    "nav_h2_objectives": "Objectives",
    "nav_h2_design": "Design Process",
    "nav_h3_cad": "&ensp;Cardboard Aided Design",
    "nav_h4_final": "&emsp;Final Design",
    "nav_h3_pcb": "&ensp;Designing the PCB",
    "nav_h3_keymap": "&ensp;My Keymap",
    "nav_h2_discoveries": "Discoveries",
    "nav_h3_plans": "&ensp;Future Plans",
    "nav_h2_bye": "The End",
    "nav_h2_home": "⌂←",
    "sunshine_h1": "Sunshine Experimental Keyboard",
    "sunshine_p1": "The Sunshine Keyboard is a custom, ergonomic, split keyboard I designed and built from scratch. It is an experimental layout focused on minimizing finger travel and maximizing comfort by using a minimal number of keys arranged in layers and accessed through combos.",
    "sunshine_p2": "This project was a deep dive into keyboard design, from physical prototyping with cardboard to designing a custom PCB and programming the firmware. This article documents that journey.",
    "tldr_h2": "Abstract (TL;DR)",
    "tldr_p1": "I designed and built a custom split ergonomic keyboard with only 36 keys. It relies heavily on layers and key combinations (combos) to access all characters, which keeps my fingers on or near the home row at all times. I prototyped the layout with cardboard, designed a custom PCB with unique artwork, and programmed it using QMK firmware. It's weird, but it's comfortable. Check out the typing test video below:",
    "intro_h2": "Background & Motivation",
    "intro_p1": "Like many people who type all day, I've found standard keyboards to be uncomfortable. After trying several commercially available ergonomic keyboards, like the Lily58 pictured here, I found that while they were an improvement, they weren't perfect for me. Many still required uncomfortable finger movements and stretches.",
    "intro_p2": "I wanted something that was built for *my* hands, not the average hand. I was inspired by the minimalist keyboard community, particularly those using keyboards with very few keys (sub-40%). The philosophy is simple: why move your fingers to a key when you can bring the key to your fingers through layers?",
    "intro_p3": "This led me to a simple conclusion: to get the perfect keyboard for me, I'd have to design it myself.",
    "objectives_h2": "Project Objectives",
    "objectives_p1": "Before I started designing, I set out a clear list of goals for the project. These were guided by a central theory of keyboard ergonomics.",
    "objectives_h3_theory": "My Grand Unified Theory of Keyboard Comfort",
    "objectives_h4_phalanges": "Phalanges First: Minimize Movement",
    "objectives_p2": "The core idea is that fingers should not stretch or travel long distances. Each key should be located directly under a finger's natural resting position. The thumb, being the strongest and most flexible digit, should be responsible for activating layers and common modifiers like <kbd>Space</kbd>, <kbd>Enter</kbd>, and <kbd>Backspace</kbd>.",
    "objectives_h4_combos": "Combos and Layers: Reduce Key Count",
    "objectives_p3": "With a limited number of keys, layers are essential. For example, holding down a thumb key might turn the home row `ASDF` into `1234`. Key combinations, or 'combos,' where you press two keys at once to trigger a different action, can further expand functionality without needing more physical keys. For example, pressing <kbd>J</kbd> and <kbd>K</kbd> together could output <kbd>Escape</kbd>.",
    "objectives_p4": "This led to the following concrete design goals:",
    "objectives_li1": "3 rows and 5 columns per hand, plus a thumb cluster.",
    "objectives_li2": "Aggressive column stagger to match natural finger lengths.",
    "objectives_li3": "A comfortable, angled thumb cluster.",
    "objectives_li4": "Heavy reliance on layers and combos to eliminate the need for number rows, function rows, or even some symbol keys.",
    "objectives_li5": "Fully programmable firmware (QMK or ZMK).",
    "objectives_li6": "A unique and personal aesthetic.",
    "objectives_li7": "Must be a split design for shoulder-width posture.",
    "design_h2": "The Design Process",
    "design_p1": "My first concept, which I called the Type-22, was drawn up in a keyboard layout editor. It had a very aggressive pinky stagger and an early idea for the thumb arc.",
    "design_p2": "However, a 2D layout on a screen doesn't tell you how it actually *feels*. For that, I needed to get physical.",
    "cad_h3": "CAD (Cardboard Aided Design)",
    "cad_p1": "Instead of immediately 3D printing a case or ordering a PCB, I turned to a cheaper and faster prototyping material: cardboard. I printed my layout at a 1:1 scale and glued it to a piece of cardboard.",
    "cad_p2": "I then painstakingly cut out switch holes. This allowed me to pop in real mechanical switches and keycaps to test the spacing and stagger.",
    "cad_p3": "This low-fidelity prototype was invaluable. I could immediately feel which columns were off, or if a thumb key was hard to reach. I made several of these cardboard prototypes, tweaking the design each time.",
    "cad_p4": "As a side benefit, typing on cardboard actually sounds surprisingly nice.",
    "final_h3": "Finalizing the Layout",
    "final_p1": "One of the first changes was to the thumb cluster. My initial design had the inner thumb key too far in, requiring an uncomfortable stretch.",
    "final_p2": "The cardboard prototype confirmed this. I adjusted the arc to be tighter and more natural to reach.",
    "final_p3": "Another iteration involved adjusting the pinky column. It turned out to be too low, so I raised it slightly.",
    "final_p4": "After a few more tweaks, I arrived at a layout that felt comfortable and natural. This became the final design that I would base the PCB on.",
    "final_p5": "This final cardboard version was my trusty guide for the rest of the project.",
    "pcb_h3": "Designing the PCB",
    "pcb_p1": "With the physical layout finalized, it was time to design the electronic brain of the keyboard: the Printed Circuit Board (PCB). I used KiCad for this process. For the PCB art, I chose the motto 'ALL IS IN YOUR HANDS'.",
    "pcb_p2": "The schematic is fairly simple for a keyboard. Each switch is part of a matrix, connected with a diode to prevent 'ghosting' (incorrect key presses being registered).",
    "pcb_p3": "I chose to use a Raspberry Pi Pico as the microcontroller because it's cheap, powerful, and well-supported by QMK firmware.",
    "pcb_p4": "The two halves of the keyboard are connected using a TRRS cable, which carries power and the data matrix signal.",
    "pcb_p5": "I added support for Kailh hot-swap sockets, which allow me to change switches easily without soldering.",
    "pcb_p6": "After routing all the traces, which was like solving a puzzle, I added the silkscreen art and generated the Gerber files for manufacturing.",
    "pcb_p7": "I sent the files off to a manufacturer and, a few weeks later, the finished boards arrived!",
    "pcb_p8": "Seeing the design go from a digital file to a physical object was incredibly rewarding.",
    "keymap_h3": "My Personal Keymap",
    "keymap_p1": "A keyboard is nothing without a good keymap. I programmed mine in QMK. It features four primary layers: a base layer for letters, a layer for numbers, a layer for symbols, and a function layer for system controls and F-keys. The layers are accessed by the thumb keys. I also make extensive use of combos for common keys like Escape and Tab.",
    "discoveries_h2": "Discoveries & Results",
    "discoveries_p1": "This project was a huge learning experience. Here are some of the key takeaways:",
    "discoveries_li1": "Prototyping with cardboard is an essential, cheap, and effective step for ergonomic designs.",
    "discoveries_li2": "The angle and position of the thumb cluster are the most critical elements for comfort.",
    "discoveries_li3": "There is a significant learning curve to using layers and combos, but it becomes second nature after a couple of weeks.",
    "discoveries_li4": "Designing a PCB is less intimidating than it seems, thanks to modern open-source software like KiCad.",
    "discoveries_li5": "There is no 'one-size-fits-all' solution for keyboards. Personalization is key.",
    "discoveries_p2": "I also discovered that a case filled with silicone provides excellent sound dampening, but I am still very tempted to just build the final case by layering hot glue, just to see what happens.",
    "plans_h2": "Future Plans",
    "plans_h3_layout": "Layout Revisions (Sunshine V2)",
    "plans_p1": "For a second version, I would experiment with adding a bit of tenting (angling the halves upwards in the middle) and maybe try a more aggressive curvature for the keywell, similar to a Dactyl or Kinesis Advantage keyboard.",
    "plans_h3_features": "New Hardware Features",
    "plans_p2": "I'm interested in adding a small OLED screen to display the current layer, or perhaps a small trackball or trackpad under the thumb to eliminate the need for a mouse.",
    "plans_h3_production": "Production & Sharing",
    "plans_p3": "I plan to release all the design files (KiCad, case models) on GitHub soon. I don't have plans for a group buy, but I hope the files will be useful for others looking to build their own perfect keyboard.",
    "bye_h2": "The End (For Now)",
    "bye_p1": "Thanks for reading about my keyboard journey! Building the Sunshine keyboard has been one of the most challenging and rewarding projects I've ever undertaken. It's not just a tool, but a reflection of a philosophy about how we interact with our computers. If you have any questions, feel free to reach out."
  },
  "he": {
    "sunshine_title": "מקלדת ניסיונית Sunshine",
    "win_gallerynav_title": "◈ ניווט.מאמר",
    "sun_win_gallery_title": "▤ sunshine.מאמר",
    "nav_h2_tldr": "תקציר",
    "nav_h2_intro": "רקע",
    "nav_h2_objectives": "מטרות",
    "nav_h2_design": "תהליך העיצוב",
    "nav_h3_cad": "‪&ensp;תכנון בעזרת קרטון‬",
    "nav_h4_final": "‪&emsp;עיצוב סופי‬",
    "nav_h3_pcb": "‪&ensp;עיצוב המעגל המודפס‬",
    "nav_h3_keymap": "‪&ensp;מיפוי המקשים שלי‬",
    "nav_h2_discoveries": "תגליות",
    "nav_h3_plans": "‪&ensp;תוכניות לעתיד‬",
    "nav_h2_bye": "הסוף",
    "nav_h2_home": "⌂←",
    "sunshine_h1": "מקלדת ניסיונית Sunshine",
    "sunshine_p1": "מקלדת ה-Sunshine היא מקלדת ארגונומית מפוצלת שעיצבתי ובניתי מאפס. זהו סידור מקשים ניסיוני המתמקד בצמצום תנועת האצבעות והגברת הנוחות, באמצעות מספר מקשים מינימלי המסודר בשכבות ונגיש דרך צירופי מקשים (קומבואים).",
    "sunshine_p2": "פרויקט זה היה צלילה עמוקה לעולם עיצוב המקלדות, החל מיצירת אב-טיפוס פיזי מקרטון, דרך עיצוב מעגל מודפס (PCB) מותאם אישית, וכלה בתכנות הקושחה (firmware). מאמר זה מתעד את המסע.",
    "tldr_h2": "תקציר (TL;DR)",
    "tldr_p1": "עיצבתי ובניתי מקלדת ארגונומית מפוצלת עם 36 מקשים בלבד. היא נשענת בכבדות על שכבות וצירופי מקשים (קומבואים) כדי לגשת לכל התווים, מה ששומר על האצבעות שלי על שורת הבית או קרוב אליה בכל עת. בניתי אב-טיפוס מקרטון, עיצבתי מעגל מודפס עם גרפיקה ייחודית, ותכנתתי אותו עם קושחת QMK. זה מוזר, אבל זה נוח. צפו בסרטון מבחן ההקלדה:",
    "intro_h2": "רקע ומוטיבציה",
    "intro_p1": "כמו רבים שמקלידים כל היום, גיליתי שמקלדות רגילות הן לא נוחות. אחרי שניסיתי כמה מקלדות ארגונומיות מסחריות, כמו ה-Lily58 שבתמונה, הבנתי שלמרות שהן היו שיפור, הן לא היו מושלמות עבורי. רבות מהן עדיין דרשו תנועות ומתיחות אצבעות לא נוחות.",
    "intro_p2": "רציתי משהו שנבנה במיוחד לידיים *שלי*, לא ליד הממוצעת. קיבלתי השראה מקהילת המקלדות המינימליסטיות, במיוחד אלו המשתמשות במקלדות עם מעט מאוד מקשים (פחות מ-40%). הפילוסופיה פשוטה: למה להזיז את האצבעות למקש כשאפשר להביא את המקש לאצבעות דרך שכבות?",
    "intro_p3": "זה הוביל אותי למסקנה פשוטה: כדי להשיג את המקלדת המושלמת בשבילי, אצטרך לעצב אותה בעצמי.",
    "objectives_h2": "מטרות הפרויקט",
    "objectives_p1": "לפני שהתחלתי לעצב, קבעתי רשימה ברורה של מטרות לפרויקט. הן התבססו על תיאוריה מרכזית של ארגונומיית מקלדות.",
    "objectives_h3_theory": "התיאוריה המאוחדת הגדולה שלי על נוחות מקלדות",
    "objectives_h4_phalanges": "קודם כל האצבעות: צמצום תנועה",
    "objectives_p2": "הרעיון המרכזי הוא שאצבעות לא צריכות להימתח או לנוע למרחקים ארוכים. כל מקש צריך להיות ממוקם ישירות מתחת לתנוחת המנוחה הטבעית של האצבע. האגודל, בהיותו האצבע החזקה והגמישה ביותר, צריך להיות אחראי על הפעלת שכבות ומקשים נפוצים כמו <kbd>רווח</kbd>, <kbd>Enter</kbd> ו-<kbd>Backspace</kbd>.",
    "objectives_h4_combos": "קומבואים ושכבות: הפחתת מספר המקשים",
    "objectives_p3": "עם מספר מוגבל של מקשים, שכבות הן חיוניות. למשל, לחיצה ארוכה על מקש אגודל יכולה להפוך את שורת הבית `ASDF` ל-`1234`. צירופי מקשים, או 'קומבואים', שבהם לוחצים על שני מקשים בו-זמנית לפעולה אחרת, יכולים להרחיב עוד יותר את הפונקציונליות בלי צורך במקשים פיזיים נוספים. למשל, לחיצה על <kbd>J</kbd> ו-<kbd>K</kbd> יחד יכולה להפיק <kbd>Escape</kbd>.",
    "objectives_p4": "כל זה הוביל למטרות העיצוב הבאות:",
    "objectives_li1": "3 שורות ו-5 עמודות לכל יד, בנוסף למקבץ אגודל.",
    "objectives_li2": "דירוג עמודות אגרסיבי שיתאים לאורך הטבעי של האצבעות.",
    "objectives_li3": "מקבץ אגודל נוח ובזווית.",
    "objectives_li4": "הסתמכות רבה על שכבות וקומבואים כדי לבטל את הצורך בשורות מספרים, פונקציות, ואפילו מקשי סמלים מסוימים.",
    "objectives_li5": "קושחה הניתנת לתכנות מלא (QMK או ZMK).",
    "objectives_li6": "אסתטיקה ייחודית ואישית.",
    "objectives_li7": "חייב להיות עיצוב מפוצל ליציבה ברוחב הכתפיים.",
    "design_h2": "תהליך העיצוב",
    "design_p1": "הקונספט הראשון שלי, שקראתי לו Type-22, שורטט בעורך סידורי מקלדת. היה לו דירוג זרת אגרסיבי מאוד ורעיון ראשוני לקשת האגודל.",
    "design_p2": "אבל, סידור דו-ממדי על מסך לא באמת אומר לך איך זה *מרגיש*. בשביל זה, הייתי צריכה משהו פיזי.",
    "cad_h3": "תכנון בעזרת קרטון (תב\"ק)",
    "cad_p1": "במקום להדפיס מיד מארז בתלת-ממד או להזמין מעגל מודפס, פניתי לחומר זול ומהיר יותר ליצירת אב-טיפוס: קרטון. הדפסתי את הסידור שלי בקנה מידה של 1:1 והדבקתי אותו על חתיכת קרטון.",
    "cad_p2": "לאחר מכן, גזרתי בעמל רב חורים למתגים. זה איפשר לי להכניס מתגים מכניים ומקשים אמיתיים כדי לבדוק את המרווחים והדירוג.",
    "cad_p3": "אב-הטיפוס הפשוט הזה היה יקר מפז. יכולתי להרגיש מיד אילו עמודות לא היו במקום, או אם מקש אגודל היה קשה להשגה. הכנתי כמה כאלה, ושיפרתי את העיצוב בכל פעם.",
    "cad_p4": "כבונוס, ההקלדה על קרטון נשמעת באופן מפתיע די נחמד.",
    "final_h3": "גיבוש הסידור הסופי",
    "final_p1": "אחד השינויים הראשונים היה במקבץ האגודל. בעיצוב הראשוני שלי, מקש האגודל הפנימי היה פנימי מדי, מה שדרש מתיחה לא נוחה.",
    "final_p2": "אב-הטיפוס מקרטון אישר זאת. התאמתי את הקשת כך שתהיה צמודה יותר וטבעית יותר להגעה.",
    "final_p3": "איטרציה נוספת כללה התאמה של עמודת הזרת. התברר שהיא הייתה נמוכה מדי, אז הרמתי אותה מעט.",
    "final_p4": "אחרי עוד כמה שינויים, הגעתי לסידור שהרגיש נוח וטבעי. זה הפך לעיצוב הסופי שעליו התבסס המעגל המודפס.",
    "final_p5": "גרסת הקרטון הסופית הזאת הייתה המדריך הנאמן שלי להמשך הפרויקט.",
    "pcb_h3": "עיצוב המעגל המודפס (PCB)",
    "pcb_p1": "עם הסידור הפיזי הסופי, הגיע הזמן לעצב את המוח האלקטרוני של המקלדת: המעגל המודפס. השתמשתי ב-KiCad לתהליך. לאמנות על המעגל בחרתי במוטו 'הכל בידיים שלך'.",
    "pcb_p2": "הסכמה החשמלית של מקלדת די פשוטה. כל מתג הוא חלק ממטריצה, ומחובר לדיודה כדי למנוע 'ghosting' (רישום לחיצות מקשים שגויות).",
    "pcb_p3": "בחרתי להשתמש ב-Raspberry Pi Pico כמיקרו-בקר כי הוא זול, חזק, ונתמך היטב על ידי קושחת QMK.",
    "pcb_p4": "שני חצאי המקלדת מחוברים באמצעות כבל TRRS, שמעביר חשמל ואת אותות המטריצה.",
    "pcb_p5": "הוספתי תמיכה בשקעי hot-swap של Kailh, המאפשרים להחליף מתגים בקלות ללא הלחמה.",
    "pcb_p6": "אחרי ששרטטתי את כל המסלולים, שזה היה כמו לפתור פאזל, הוספתי את הגרפיקה ויצרתי את קבצי הגרבר לייצור.",
    "pcb_p7": "שלחתי את הקבצים ליצרן, וכמה שבועות לאחר מכן, הלוחות המוגמרים הגיעו!",
    "pcb_p8": "לראות את העיצוב הופך מקובץ דיגיטלי לחפץ פיזי היה מתגמל להפליא.",
    "keymap_h3": "מיפוי המקשים האישי שלי",
    "keymap_p1": "מקלדת היא כלום בלי מיפוי מקשים טוב. תכנתתי את שלי ב-QMK. היא כוללת ארבע שכבות עיקריות: שכבת בסיס לאותיות, שכבה למספרים, שכבה לסמלים, ושכבת פונקציות לבקרת מערכת ומקשי F. הגישה לשכבות נעשית דרך מקשי האגודל. אני גם משתמשת רבות בקומבואים למקשים נפוצים כמו Escape ו-Tab.",
    "discoveries_h2": "תגליות ותוצאות",
    "discoveries_p1": "הפרויקט הזה היה חווית למידה ענקית. הנה כמה מהתובנות המרכזיות:",
    "discoveries_li1": "יצירת אב-טיפוס מקרטון היא שלב חיוני, זול ויעיל לעיצובים ארגונומיים.",
    "discoveries_li2": "הזווית והמיקום של מקבץ האגודל הם המרכיבים הקריטיים ביותר לנוחות.",
    "discoveries_li3": "יש עקומת למידה משמעותית לשימוש בשכבות ובקומבואים, אבל זה הופך לטבע שני אחרי כמה שבועות.",
    "discoveries_li4": "עיצוב מעגל מודפס פחות מאיים ממה שזה נראה, הודות לתוכנות קוד פתוח מודרניות כמו KiCad.",
    "discoveries_li5": "אין פתרון 'מידה אחת מתאימה לכולם' למקלדות. התאמה אישית היא המפתח.",
    "discoveries_p2": "גיליתי גם שמארז מלא בסיליקון מספק שיכוך צלילים מעולה, אבל אני עדיין מתפתה לבנות את המארז הסופי משכבות של דבק חם, רק כדי לראות מה יקרה.",
    "plans_h2": "תוכניות לעתיד",
    "plans_h3_layout": "שיפורי סידור (Sunshine V2)",
    "plans_p1": "בגרסה שנייה, אתנסה בהוספת 'אוהל' (הטיית החצאים כלפי מעלה באמצע) ואולי אנסה קיעור אגרסיבי יותר של המקשים, בדומה למקלדת Dactyl או Kinesis Advantage.",
    "plans_h3_features": "תכונות חומרה חדשות",
    "plans_p2": "אני מעוניינת להוסיף מסך OLED קטן שיציג את השכבה הנוכחית, או אולי כדור עקיבה קטן או משטח עקיבה מתחת לאגודל כדי לבטל את הצורך בעכבר.",
    "plans_h3_production": "ייצור ושיתוף",
    "plans_p3": "אני מתכננת לשחרר את כל קבצי העיצוב (KiCad, מודלי מארז) ב-GitHub בקרוב. אין לי תוכניות לרכישה קבוצתית, אבל אני מקווה שהקבצים יועילו לאחרים שרוצים לבנות את המקלדת המושלמת שלהם.",
    "bye_h2": "הסוף (בינתיים)",
    "bye_p1": "תודה שקראתם על מסע המקלדת שלי! בניית ה-Sunshine הייתה אחד הפרויקטים המאתגרים והמתגמלים ביותר שעשיתי. זה לא רק כלי, אלא השקפת עולם על האופן שבו אנו מתקשרים עם המחשבים שלנו. אם יש לכם שאלות, אתם מוזמנים לפנות אליי."
  },
  "ru": {
    "sunshine_title": "Экспериментальная клавиатура Sunshine",
    "win_gallerynav_title": "◈ навигация.статья",
    "sun_win_gallery_title": "▤ sunshine.статья",
    "nav_h2_tldr": "Кратко",
    "nav_h2_intro": "Предыстория",
    "nav_h2_objectives": "Цели",
    "nav_h2_design": "Процесс проектирования",
    "nav_h3_cad": "&ensp;Картонное проектирование",
    "nav_h4_final": "&emsp;Финальный дизайн",
    "nav_h3_pcb": "&ensp;Проектирование платы",
    "nav_h3_keymap": "&ensp;Моя раскладка",
    "nav_h2_discoveries": "Выводы",
    "nav_h3_plans": "&ensp;Планы на будущее",
    "nav_h2_bye": "Конец",
    "nav_h2_home": "⌂←",
    "sunshine_h1": "Экспериментальная клавиатура Sunshine",
    "sunshine_p1": "Sunshine Keyboard — это кастомная, эргономичная, раздельная клавиатура, которую я спроектировала и собрала с нуля. Это экспериментальная раскладка, нацеленная на минимизацию движений пальцев и максимальный комфорт за счёт минимального количества клавиш, расположенных на слоях и доступных через комбинации.",
    "sunshine_p2": "Этот проект стал глубоким погружением в дизайн клавиатур: от физического прототипирования на картоне до разработки собственной печатной платы и программирования прошивки. Эта статья документирует этот путь.",
    "tldr_h2": "Краткое содержание (TL;DR)",
    "tldr_p1": "Я спроектировала и собрала кастомную раздельную эргономичную клавиатуру всего с 36 клавишами. Она активно использует слои и комбинации клавиш (комбо) для доступа ко всем символам, что позволяет моим пальцам всегда находиться на домашнем ряду или рядом с ним. Я сделала прототип раскладки из картона, спроектировала печатную плату с уникальным рисунком и запрограммировала её с помощью прошивки QMK. Клавиатура странная, но удобная. Посмотрите видео с тестом печати ниже:",
    "intro_h2": "Предыстория и мотивация",
    "intro_p1": "Как и многие, кто печатает целый день, я считаю стандартные клавиатуры неудобными. Попробовав несколько коммерческих эргономичных клавиатур, вроде изображённой здесь Lily58, я поняла, что, хотя они и лучше, для меня они не идеальны. Многие из них всё равно требовали неудобных движений и растяжек пальцев.",
    "intro_p2": "Мне хотелось чего-то, созданного специально для *моих* рук, а не для среднестатистических. Меня вдохновило сообщество минималистичных клавиатур, особенно те, кто использует клавиатуры с очень малым количеством клавиш (менее 40%). Философия проста: зачем тянуться пальцами к клавише, если можно «принести» клавишу к пальцам с помощью слоёв?",
    "intro_p3": "Это привело меня к простому выводу: чтобы получить идеальную для себя клавиатуру, мне придётся спроектировать её самой.",
    "objectives_h2": "Цели проекта",
    "objectives_p1": "Прежде чем начать проектирование, я составила чёткий список целей. Они основывались на центральной теории эргономики клавиатур.",
    "objectives_h3_theory": "Моя Великая Объединённая Теория Клавиатурного Комфорта",
    "objectives_h4_phalanges": "Пальцы прежде всего: минимизация движений",
    "objectives_p2": "Основная идея в том, что пальцы не должны растягиваться или перемещаться на большие расстояния. Каждая клавиша должна располагаться прямо под естественным положением покоя пальца. Большой палец, как самый сильный и гибкий, должен отвечать за активацию слоёв и частых модификаторов, таких как <kbd>Пробел</kbd>, <kbd>Enter</kbd> и <kbd>Backspace</kbd>.",
    "objectives_h4_combos": "Комбо и слои: сокращение числа клавиш",
    "objectives_p3": "С ограниченным количеством клавиш слои становятся необходимостью. Например, удержание клавиши под большим пальцем может превратить домашний ряд `ASDF` в `1234`. Комбинации клавиш, или «комбо», когда вы нажимаете две клавиши одновременно для вызова другого действия, могут ещё больше расширить функциональность без добавления физических клавиш. Например, одновременное нажатие <kbd>J</kbd> и <kbd>K</kbd> может выдать <kbd>Escape</kbd>.",
    "objectives_p4": "Это привело к следующим конкретным целям проектирования:",
    "objectives_li1": "3 ряда и 5 столбцов для каждой руки, плюс кластер для большого пальца.",
    "objectives_li2": "Агрессивное смещение столбцов в соответствии с естественной длиной пальцев.",
    "objectives_li3": "Удобный, расположенный под углом кластер для большого пальца.",
    "objectives_li4": "Активное использование слоёв и комбо для устранения необходимости в ряде цифр, функциональных клавиш и даже некоторых символьных клавиш.",
    "objectives_li5": "Полностью программируемая прошивка (QMK или ZMK).",
    "objectives_li6": "Уникальный и личный дизайн.",
    "objectives_li7": "Обязательно раздельная конструкция для осанки на ширине плеч.",
    "design_h2": "Процесс проектирования",
    "design_p1": "Моя первая концепция, которую я назвала Type-22, была набросана в редакторе раскладок. У неё было очень агрессивное смещение для мизинца и ранняя идея дуги для большого пальца.",
    "design_p2": "Однако 2D-раскладка на экране не даёт понять, как она на самом деле *ощущается*. Для этого мне нужно было что-то физическое.",
    "cad_h3": "САПР (Система автоматизированного проектирования... на картоне)",
    "cad_p1": "Вместо того чтобы сразу печатать корпус на 3D-принтере или заказывать плату, я обратилась к более дешёвому и быстрому материалу для прототипирования: картону. Я распечатала свою раскладку в масштабе 1:1 и приклеила её на кусок картона.",
    "cad_p2": "Затем я кропотливо вырезала отверстия для переключателей. Это позволило мне вставить настоящие механические переключатели и кейкапы, чтобы проверить расстояние и смещение.",
    "cad_p3": "Этот простой прототип оказался бесценным. Я сразу почувствовала, какие столбцы расположены неверно, или если до клавиши большого пальца трудно дотянуться. Я сделала несколько таких картонных прототипов, каждый раз дорабатывая дизайн.",
    "cad_p4": "Как побочный эффект, печать на картоне на удивление приятно звучит.",
    "final_h3": "Финализация раскладки",
    "final_p1": "Одним из первых изменений стал кластер для большого пальца. В моём первоначальном дизайне внутренняя клавиша большого пальца была слишком далеко, что требовало неудобной растяжки.",
    "final_p2": "Картонный прототип это подтвердил. Я скорректировала дугу, сделав её более плотной и естественной для нажатия.",
    "final_p3": "Другая итерация включала корректировку столбца для мизинца. Оказалось, что он был слишком низко, поэтому я его немного приподняла.",
    "final_p4": "После ещё нескольких доработок я пришла к раскладке, которая казалась удобной и естественной. Она и стала основой для финального дизайна печатной платы.",
    "final_p5": "Эта финальная картонная версия была моим верным ориентиром до конца проекта.",
    "pcb_h3": "Проектирование печатной платы (PCB)",
    "pcb_p1": "Когда физическая раскладка была готова, пришло время спроектировать электронный «мозг» клавиатуры: печатную плату (PCB). Я использовала для этого KiCad. В качестве рисунка на плате я выбрала девиз «ВСЁ В ТВОИХ РУКАХ».",
    "pcb_p2": "Схема для клавиатуры довольно проста. Каждый переключатель — часть матрицы, соединённая с диодом для предотвращения «гостинга» (регистрации ложных нажатий).",
    "pcb_p3": "В качестве микроконтроллера я выбрала Raspberry Pi Pico, потому что он дешёвый, мощный и хорошо поддерживается прошивкой QMK.",
    "pcb_p4": "Две половины клавиатуры соединены кабелем TRRS, который передаёт питание и сигнал матрицы данных.",
    "pcb_p5": "Я добавила поддержку сокетов Kailh для горячей замены, что позволяет легко менять переключатели без пайки.",
    "pcb_p6": "После разводки всех дорожек, что было похоже на решение головоломки, я добавила шелкографию и сгенерировала файлы Gerber для производства.",
    "pcb_p7": "Я отправила файлы производителю, и через несколько недель готовые платы были у меня!",
    "pcb_p8": "Видеть, как дизайн из цифрового файла превращается в физический объект, было невероятно приятно.",
    "keymap_h3": "Моя личная раскладка",
    "keymap_p1": "Клавиатура — ничто без хорошей раскладки. Я запрограммировала свою в QMK. В ней четыре основных слоя: базовый для букв, слой для цифр, слой для символов и функциональный слой для системных команд и F-клавиш. Слои активируются клавишами под большим пальцем. Я также активно использую комбо для частых клавиш вроде Escape и Tab.",
    "discoveries_h2": "Выводы и результаты",
    "discoveries_p1": "Этот проект стал огромным опытом. Вот некоторые из ключевых выводов:",
    "discoveries_li1": "Прототипирование на картоне — важный, дешёвый и эффективный шаг для эргономичного дизайна.",
    "discoveries_li2": "Угол и положение кластера для большого пальца — самые критичные элементы для комфорта.",
    "discoveries_li3": "Использование слоёв и комбо требует привыкания, но через пару недель это входит в привычку.",
    "discoveries_li4": "Проектирование печатной платы не так страшно, как кажется, благодаря современному открытому ПО вроде KiCad.",
    "discoveries_li5": "Универсального решения для клавиатур не существует. Персонализация — это ключ.",
    "discoveries_p2": "Я также обнаружила, что корпус, заполненный силиконом, отлично гасит звук, но у меня всё ещё велик соблазн просто собрать финальный корпус из слоёв горячего клея, чтобы посмотреть, что получится.",
    "plans_h2": "Планы на будущее",
    "plans_h3_layout": "Изменения в раскладке (Sunshine V2)",
    "plans_p1": "Во второй версии я бы поэкспериментировала с добавлением небольшого «тентинга» (наклон половинок вверх в центре) и, возможно, попробовала бы более агрессивную вогнутость клавиш, как у клавиатур Dactyl или Kinesis Advantage.",
    "plans_h3_features": "Новые аппаратные возможности",
    "plans_p2": "Мне интересно добавить маленький OLED-экран для отображения текущего слоя или, возможно, небольшой трекбол или трекпад под большим пальцем, чтобы избавиться от мыши.",
    "plans_h3_production": "Производство и публикация",
    "plans_p3": "В ближайшее время я планирую выложить все файлы дизайна (KiCad, модели корпуса) на GitHub. У меня нет планов на групповую закупку, но я надеюсь, что файлы будут полезны другим, кто захочет создать свою идеальную клавиатуру.",
    "bye_h2": "Конец (на данный момент)",
    "bye_p1": "Спасибо, что прочитали о моём клавиатурном путешествии! Создание Sunshine было одним из самых сложных и полезных проектов, за которые я когда-либо бралась. Это не просто инструмент, а отражение философии о том, как мы взаимодействуем с нашими компьютерами. Если у вас есть вопросы, смело обращайтесь."
  },
  "de": {
    "sunshine_title": "Experimentelle Tastatur Sunshine",
    "win_gallerynav_title": "◈ artikel.navigation",
    "sun_win_gallery_title": "▤ sunshine.artikel",
    "nav_h2_tldr": "Zusammenfassung",
    "nav_h2_intro": "Hintergrund",
    "nav_h2_objectives": "Ziele",
    "nav_h2_design": "Designprozess",
    "nav_h3_cad": "&ensp;Papp-gestütztes Design",
    "nav_h4_final": "&emsp;Finales Design",
    "nav_h3_pcb": "&ensp;Design der Leiterplatte",
    "nav_h3_keymap": "&ensp;Meine Tastenbelegung",
    "nav_h2_discoveries": "Erkenntnisse",
    "nav_h3_plans": "&ensp;Zukunftspläne",
    "nav_h2_bye": "Das Ende",
    "nav_h2_home": "⌂←",
    "sunshine_h1": "Experimentelle Tastatur Sunshine",
    "sunshine_p1": "Die Sunshine-Tastatur ist eine maßgefertigte, ergonomische, geteilte Tastatur, die ich von Grund auf entworfen und gebaut habe. Es ist ein experimentelles Layout, das darauf abzielt, Fingerwege zu minimieren und den Komfort zu maximieren, indem eine minimale Anzahl von Tasten verwendet wird, die in Ebenen angeordnet sind und über Kombinationen (Combos) aufgerufen werden.",
    "sunshine_p2": "Dieses Projekt war ein tiefer Einblick in das Tastaturdesign, vom physischen Prototyping mit Pappe über den Entwurf einer eigenen Leiterplatte bis hin zur Programmierung der Firmware. Dieser Artikel dokumentiert diese Reise.",
    "tldr_h2": "Zusammenfassung (TL;DR)",
    "tldr_p1": "Ich habe eine maßgefertigte, geteilte, ergonomische Tastatur mit nur 36 Tasten entworfen und gebaut. Sie verlässt sich stark auf Ebenen und Tastenkombinationen (Combos), um alle Zeichen zu erreichen, wodurch meine Finger jederzeit auf oder nahe der Grundreihe bleiben. Ich habe das Layout mit Pappe als Prototyp erstellt, eine eigene Leiterplatte mit einzigartigem Design entworfen und sie mit der QMK-Firmware programmiert. Sie ist seltsam, aber bequem. Schauen Sie sich das Tipp-Test-Video unten an:",
    "intro_h2": "Hintergrund & Motivation",
    "intro_p1": "Wie viele Menschen, die den ganzen Tag tippen, empfinde ich Standardtastaturen als unbequem. Nachdem ich mehrere handelsübliche ergonomische Tastaturen ausprobiert hatte, wie die hier abgebildete Lily58, stellte ich fest, dass sie zwar eine Verbesserung waren, aber für mich nicht perfekt. Viele erforderten immer noch unbequeme Fingerbewegungen und -streckungen.",
    "intro_p2": "Ich wollte etwas, das für *meine* Hände gebaut war, nicht für die Durchschnittshand. Inspiriert wurde ich von der Community der minimalistischen Tastaturen, insbesondere von denen, die Tastaturen mit sehr wenigen Tasten (unter 40%) verwenden. Die Philosophie ist einfach: Warum die Finger zu einer Taste bewegen, wenn man die Taste durch Ebenen zu den Fingern bringen kann?",
    "intro_p3": "Dies führte mich zu einer einfachen Schlussfolgerung: Um die perfekte Tastatur für mich zu bekommen, musste ich sie selbst entwerfen.",
    "objectives_h2": "Projektziele",
    "objectives_p1": "Bevor ich mit dem Entwerfen begann, legte ich eine klare Liste von Zielen für das Projekt fest. Diese orientierten sich an einer zentralen Theorie der Tastaturergonomie.",
    "objectives_h3_theory": "Meine große vereinheitlichte Theorie des Tastaturkomforts",
    "objectives_h4_phalanges": "Fingerglieder zuerst: Bewegung minimieren",
    "objectives_p2": "Die Kernidee ist, dass die Finger sich nicht strecken oder weite Wege zurücklegen sollten. Jede Taste sollte sich direkt unter der natürlichen Ruheposition eines Fingers befinden. Der Daumen, als stärkster und flexibelster Finger, sollte für die Aktivierung von Ebenen und häufigen Modifikatortasten wie <kbd>Leertaste</kbd>, <kbd>Enter</kbd> und <kbd>Backspace</kbd> zuständig sein.",
    "objectives_h4_combos": "Combos und Ebenen: Tastenanzahl reduzieren",
    "objectives_p3": "Bei einer begrenzten Anzahl von Tasten sind Ebenen unerlässlich. Zum Beispiel könnte das Halten einer Daumentaste die Grundreihe `ASDF` in `1234` verwandeln. Tastenkombinationen oder „Combos“, bei denen man zwei Tasten gleichzeitig drückt, um eine andere Aktion auszulösen, können die Funktionalität weiter erweitern, ohne mehr physische Tasten zu benötigen. Zum Beispiel könnte das gemeinsame Drücken von <kbd>J</kbd> und <kbd>K</kbd> die Taste <kbd>Escape</kbd> ausgeben.",
    "objectives_p4": "Dies führte zu den folgenden konkreten Designzielen:",
    "objectives_li1": "3 Reihen und 5 Spalten pro Hand, plus ein Daumen-Cluster.",
    "objectives_li2": "Aggressiver Spaltenversatz, der den natürlichen Fingerlängen entspricht.",
    "objectives_li3": "Ein bequemer, abgewinkelter Daumen-Cluster.",
    "objectives_li4": "Starke Nutzung von Ebenen und Combos, um die Notwendigkeit von Zahlenreihen, Funktionsreihen oder sogar einigen Symboltasten zu eliminieren.",
    "objectives_li5": "Vollständig programmierbare Firmware (QMK oder ZMK).",
    "objectives_li6": "Eine einzigartige und persönliche Ästhetik.",
    "objectives_li7": "Muss ein geteiltes Design für eine schulterbreite Haltung sein.",
    "design_h2": "Der Designprozess",
    "design_p1": "Mein erstes Konzept, das ich Type-22 nannte, wurde in einem Tastaturlayout-Editor entworfen. Es hatte einen sehr aggressiven Versatz für den kleinen Finger und eine frühe Idee für den Daumenbogen.",
    "design_p2": "Ein 2D-Layout auf einem Bildschirm verrät einem jedoch nicht, wie es sich tatsächlich *anfühlt*. Dafür musste ich etwas Physisches in die Hand nehmen.",
    "cad_h3": "CAD (Cardboard Aided Design / Papp-gestütztes Design)",
    "cad_p1": "Anstatt sofort ein Gehäuse zu 3D-drucken oder eine Leiterplatte zu bestellen, griff ich zu einem günstigeren und schnelleren Prototyping-Material: Pappe. Ich druckte mein Layout im Maßstab 1:1 aus und klebte es auf ein Stück Pappe.",
    "cad_p2": "Dann schnitt ich sorgfältig die Löcher für die Schalter aus. Dies ermöglichte es mir, echte mechanische Schalter und Tastenkappen einzusetzen, um den Abstand und den Versatz zu testen.",
    "cad_p3": "Dieser einfache Prototyp war von unschätzbarem Wert. Ich konnte sofort spüren, welche Spalten falsch platziert waren oder ob eine Daumentaste schwer zu erreichen war. Ich habe mehrere dieser Papp-Prototypen hergestellt und das Design jedes Mal optimiert.",
    "cad_p4": "Als netter Nebeneffekt klingt das Tippen auf Pappe überraschend gut.",
    "final_h3": "Finalisierung des Layouts",
    "final_p1": "Eine der ersten Änderungen betraf den Daumen-Cluster. Mein ursprüngliches Design hatte die innere Daumentaste zu weit innen, was eine unbequeme Streckung erforderte.",
    "final_p2": "Der Papp-Prototyp bestätigte dies. Ich passte den Bogen an, um ihn enger und natürlicher erreichbar zu machen.",
    "final_p3": "Eine weitere Iteration umfasste die Anpassung der Spalte für den kleinen Finger. Es stellte sich heraus, dass sie zu niedrig war, also hob ich sie leicht an.",
    "final_p4": "Nach ein paar weiteren Anpassungen kam ich zu einem Layout, das sich bequem und natürlich anfühlte. Dies wurde das endgültige Design, auf dem die Leiterplatte basieren sollte.",
    "final_p5": "Diese endgültige Pappversion war mein treuer Wegweiser für den Rest des Projekts.",
    "pcb_h3": "Design der Leiterplatte (PCB)",
    "pcb_p1": "Nachdem das physische Layout fertig war, war es an der Zeit, das elektronische Gehirn der Tastatur zu entwerfen: die Leiterplatte (PCB). Ich habe dafür KiCad verwendet. Für die Leiterplattenkunst wählte ich das Motto „ALLES LIEGT IN DEINEN HÄNDEN“.",
    "pcb_p2": "Der Schaltplan für eine Tastatur ist ziemlich einfach. Jeder Schalter ist Teil einer Matrix, verbunden mit einer Diode, um „Ghosting“ (fälschlicherweise registrierte Tastenanschläge) zu verhindern.",
    "pcb_p3": "Ich entschied mich für einen Raspberry Pi Pico als Mikrocontroller, weil er günstig, leistungsstark und gut von der QMK-Firmware unterstützt wird.",
    "pcb_p4": "Die beiden Hälften der Tastatur sind über ein TRRS-Kabel verbunden, das Strom und das Datenmatrixsignal überträgt.",
    "pcb_p5": "Ich habe Unterstützung für Kailh-Hot-Swap-Sockel hinzugefügt, die es mir ermöglichen, Schalter einfach ohne Löten zu wechseln.",
    "pcb_p6": "Nachdem ich alle Leiterbahnen verlegt hatte, was wie das Lösen eines Puzzles war, fügte ich den Siebdruck hinzu und erstellte die Gerber-Dateien für die Herstellung.",
    "pcb_p7": "Ich schickte die Dateien an einen Hersteller und einige Wochen später kamen die fertigen Platinen an!",
    "pcb_p8": "Zu sehen, wie das Design von einer digitalen Datei zu einem physischen Objekt wurde, war unglaublich bereichernd.",
    "keymap_h3": "Meine persönliche Tastenbelegung",
    "keymap_p1": "Eine Tastatur ist nichts ohne eine gute Tastenbelegung. Ich habe meine in QMK programmiert. Sie verfügt über vier primäre Ebenen: eine Basisebene für Buchstaben, eine Zahlenebene, eine Symbolebene und eine Funktionsebene für Systemsteuerungen und F-Tasten. Der Zugriff auf die Ebenen erfolgt über die Daumentasten. Ich nutze auch ausgiebig Combos für häufig verwendete Tasten wie Escape und Tab.",
    "discoveries_h2": "Erkenntnisse & Ergebnisse",
    "discoveries_p1": "Dieses Projekt war eine riesige Lernerfahrung. Hier sind einige der wichtigsten Erkenntnisse:",
    "discoveries_li1": "Prototyping mit Pappe ist ein wesentlicher, günstiger und effektiver Schritt für ergonomische Designs.",
    "discoveries_li2": "Der Winkel und die Position des Daumen-Clusters sind die entscheidendsten Elemente für den Komfort.",
    "discoveries_li3": "Die Verwendung von Ebenen und Combos hat eine erhebliche Lernkurve, wird aber nach ein paar Wochen zur zweiten Natur.",
    "discoveries_li4": "Das Design einer Leiterplatte ist weniger einschüchternd, als es scheint, dank moderner Open-Source-Software wie KiCad.",
    "discoveries_li5": "Es gibt keine „Einheitsgröße“-Lösung für Tastaturen. Personalisierung ist der Schlüssel.",
    "discoveries_p2": "Ich habe auch entdeckt, dass ein mit Silikon gefülltes Gehäuse eine ausgezeichnete Schalldämmung bietet, aber ich bin immer noch sehr versucht, das endgültige Gehäuse einfach aus Schichten von Heißkleber zu bauen, nur um zu sehen, was passiert.",
    "plans_h2": "Zukunftspläne",
    "plans_h3_layout": "Layout-Überarbeitungen (Sunshine V2)",
    "plans_p1": "Für eine zweite Version würde ich mit etwas „Tenting“ (dem Anwinkeln der Hälften in der Mitte nach oben) experimentieren und vielleicht eine aggressivere Krümmung für die Tastenmulden ausprobieren, ähnlich einer Dactyl- oder Kinesis-Advantage-Tastatur.",
    "plans_h3_features": "Neue Hardware-Funktionen",
    "plans_p2": "Ich bin daran interessiert, einen kleinen OLED-Bildschirm hinzuzufügen, um die aktuelle Ebene anzuzeigen, oder vielleicht einen kleinen Trackball oder ein Trackpad unter dem Daumen, um die Notwendigkeit einer Maus zu beseitigen.",
    "plans_h3_production": "Produktion & Veröffentlichung",
    "plans_p3": "Ich plane, alle Designdateien (KiCad, Gehäusemodelle) bald auf GitHub zu veröffentlichen. Ich habe keine Pläne für einen Group Buy, aber ich hoffe, die Dateien werden für andere nützlich sein, die ihre eigene perfekte Tastatur bauen möchten.",
    "bye_h2": "Das Ende (vorerst)",
    "bye_p1": "Danke, dass du meine Tastatur-Reise mitverfolgt hast! Der Bau der Sunshine-Tastatur war eines der herausforderndsten und lohnendsten Projekte, die ich je in Angriff genommen habe. Sie ist nicht nur ein Werkzeug, sondern spiegelt eine Philosophie darüber wider, wie wir mit unseren Computern interagieren. Wenn du Fragen hast, melde dich einfach."
  },
  "ja": {
    "sunshine_title": "実験的キーボード「サンシャイン」",
    "win_gallerynav_title": "◈ 記事.nav",
    "sun_win_gallery_title": "▤ sunshine.記事",
    "nav_h2_tldr": "要約",
    "nav_h2_intro": "背景",
    "nav_h2_objectives": "目的",
    "nav_h2_design": "設計プロセス",
    "nav_h3_cad": "&ensp;段ボール支援設計",
    "nav_h4_final": "&emsp;最終設計",
    "nav_h3_pcb": "&ensp;基板設計",
    "nav_h3_keymap": "&ensp;私のキーマップ",
    "nav_h2_discoveries": "発見",
    "nav_h3_plans": "&ensp;今後の計画",
    "nav_h2_bye": "おわりに",
    "nav_h2_home": "⌂←",
    "sunshine_h1": "実験的キーボード「サンシャイン」",
    "sunshine_p1": "「サンシャインキーボード」は、私がゼロから設計・製作した、人間工学に基づいたカスタム分割式キーボードです。これは、キーの数を最小限に抑え、それらをレイヤー構造とキーの組み合わせ（コンボ）で操作することで、指の移動距離を減らし快適性を最大限に高めることを目指した実験的な配列です。",
    "sunshine_p2": "このプロジェクトは、段ボールによる物理的な試作品作りから、カスタム基板（PCB）の設計、ファームウェアのプログラミングに至るまで、キーボード設計の世界への深い探求となりました。この記事では、その道のりを記録しています。",
    "tldr_h2": "要約 (TL;DR)",
    "tldr_p1": "私はわずか36キーのカスタム分割型エルゴキーボードを設計・製作しました。すべての文字入力はレイヤーとキーの同時押し（コンボ）に大きく依存しており、これにより指は常にホームポジションかそのすぐ近くに留まります。段ボールで配列の試作品を作り、ユニークなアートワークを施したカスタム基板を設計し、QMKファームウェアでプログラムしました。変わっていますが、快適です。以下のタイピングテスト動画をご覧ください：",
    "intro_h2": "背景と動機",
    "intro_p1": "一日中タイピングする多くの人々と同様に、私も標準的なキーボードは不快だと感じていました。ここに写っているLily58のような市販のエルゴキーボードをいくつか試しましたが、改善はされたものの、私にとって完璧ではありませんでした。多くは依然として不快な指の動きやストレッチを必要としました。",
    "intro_p2": "私は平均的な手ではなく、*私の*手のために作られたものが欲しかったのです。私はミニマリストキーボードのコミュニティ、特にキーが極端に少ない（40%未満）キーボードを使う人々に触発されました。その哲学は単純です。「レイヤーを使えばキーを指元に持ってこれるのに、なぜわざわざ指をキーまで動かすのか？」",
    "intro_p3": "これは私を単純な結論に導きました。自分にとって完璧なキーボードを手に入れるには、自分で設計するしかない、と。",
    "objectives_h2": "プロジェクトの目的",
    "objectives_p1": "設計を始める前に、プロジェクトの明確な目標リストを設定しました。これらはキーボードの人間工学に関する中心的な理論に基づいています。",
    "objectives_h3_theory": "私のキーボード快適性に関する大統一理論",
    "objectives_h4_phalanges": "指が第一：動きの最小化",
    "objectives_p2": "中心的な考え方は、指を伸ばしたり長距離を移動させたりすべきではない、ということです。各キーは指の自然なホームポジションの真下に配置されるべきです。最も強くて柔軟な指である親指は、レイヤーの有効化や<kbd>スペース</kbd>、<kbd>Enter</kbd>、<kbd>Backspace</kbd>といった多用する修飾キーを担当すべきです。",
    "objectives_h4_combos": "コンボとレイヤー：キー数の削減",
    "objectives_p3": "キーの数が限られているため、レイヤーは不可欠です。例えば、親指キーを押し続けると、ホームポジションの`ASDF`が`1234`に変わる、といった具合です。キーの組み合わせ、つまり「コンボ」（2つのキーを同時に押して別のアクションを発動する）を使えば、物理キーを増やさずに機能をさらに拡張できます。例えば、<kbd>J</kbd>と<kbd>K</kbd>を同時に押すと<kbd>Escape</kbd>が入力されるようにできます。",
    "objectives_p4": "これにより、以下の具体的な設計目標が導き出されました：",
    "objectives_li1": "片手につき3行5列、加えて親指クラスター。",
    "objectives_li2": "自然な指の長さに合わせた、大胆なカラムスタッガー（列のずらし）。",
    "objectives_li3": "快適な角度のついた親指クラスター。",
    "objectives_li4": "数字行、ファンクション行、さらには一部の記号キーさえも不要にするための、レイヤーとコンボへの強い依存。",
    "objectives_li5": "完全にプログラム可能なファームウェア（QMKまたはZMK）。",
    "objectives_li6": "ユニークで個人的なデザイン性。",
    "objectives_li7": "肩幅に合わせた姿勢のための分割設計であること。",
    "design_h2": "設計プロセス",
    "design_p1": "私が「Type-22」と名付けた最初のコンセプトは、キーボードレイアウトエディタで作成されました。非常に大胆な小指のずらしと、親指の弧に関する初期のアイデアがありました。",
    "design_p2": "しかし、画面上の2Dレイアウトでは、それが実際に*どう感じるか*はわかりません。そのためには、物理的なものが必要でした。",
    "cad_h3": "CAD（Cardboard Aided Design / 段ボール支援設計）",
    "cad_p1": "すぐにケースを3Dプリントしたり基板を発注したりする代わりに、より安価で迅速な試作材料である段ボールに目を向けました。レイアウトを原寸大で印刷し、段ボールに貼り付けました。",
    "cad_p2": "次に、丹念にスイッチ用の穴を切り抜きました。これにより、本物のメカニカルスイッチとキーキャップをはめ込み、間隔やずれを試すことができました。",
    "cad_p3": "この手軽な試作品は非常に貴重でした。どの列がずれているか、親指キーが押しにくいかをすぐに感じ取ることができました。私はこの段ボール試作品をいくつか作り、その都度デザインを微調整しました。",
    "cad_p4": "おまけに、段ボールでタイピングすると驚くほど良い音がします。",
    "final_h3": "レイアウトの最終決定",
    "final_p1": "最初の変更点の一つは親指クラスターでした。初期のデザインでは、内側の親指キーが奥に入りすぎており、不快な指の伸ばしが必要でした。",
    "final_p2": "段ボールの試作品がこれを確認させてくれました。私は弧をよりコンパクトで自然に届くように調整しました。",
    "final_p3": "別の試作では、小指の列を調整しました。低すぎることが判明したため、少し持ち上げました。",
    "final_p4": "さらにいくつかの微調整を経て、快適で自然に感じるレイアウトにたどり着きました。これが、基板の元となる最終デザインとなりました。",
    "final_p5": "この最終的な段ボール版は、プロジェクトの残りの期間、私の頼れる指針となりました。",
    "pcb_h3": "基板（PCB）の設計",
    "pcb_p1": "物理的なレイアウトが固まったので、キーボードの電子頭脳であるプリント基板（PCB）を設計する時が来ました。このプロセスにはKiCadを使用しました。基板アートには、「すべてはあなたの手の中に」というモットーを選びました。",
    "pcb_p2": "キーボードの回路図はかなり単純です。各スイッチはマトリックスの一部であり、「ゴースティング」（誤ったキー入力の登録）を防ぐためにダイオードで接続されています。",
    "pcb_p3": "マイクロコントローラーにはRaspberry Pi Picoを選びました。安価で強力、そしてQMKファームウェアで十分にサポートされているためです。",
    "pcb_p4": "キーボードの左右のパーツは、電源とデータマトリックス信号を運ぶTRRSケーブルで接続されています。",
    "pcb_p5": "Kailhのホットスワップソケットに対応させました。これにより、はんだ付けなしで簡単にスイッチを交換できます。",
    "pcb_p6": "パズルを解くような全ての配線を終えた後、シルクスクリーンのアートワークを追加し、製造用のガーバーファイルを生成しました。",
    "pcb_p7": "ファイルを製造業者に送り、数週間後、完成した基板が届きました！",
    "pcb_p8": "デザインがデジタルファイルから物理的なモノになるのを見るのは、信じられないほどやりがいのあることでした。",
    "keymap_h3": "私の個人用キーマップ",
    "keymap_p1": "良いキーマップがなければキーボードは始まりません。私はQMKで自分のキーマップをプログラムしました。主に4つのレイヤーがあります：文字用のベースレイヤー、数字用レイヤー、記号用レイヤー、そしてシステム制御やFキー用のファンクションレイヤーです。レイヤーは親指キーでアクセスします。また、EscapeやTabのような多用するキーにはコンボを積極的に活用しています。",
    "discoveries_h2": "発見と成果",
    "discoveries_p1": "このプロジェクトは非常に大きな学びの経験でした。以下に主要なポイントをいくつか挙げます：",
    "discoveries_li1": "人間工学に基づいた設計において、段ボールでの試作は不可欠かつ安価で効果的なステップである。",
    "discoveries_li2": "親指クラスターの角度と位置が、快適性にとって最も重要な要素である。",
    "discoveries_li3": "レイヤーとコンボの習得にはかなりの時間がかかるが、数週間で第二の天性となる。",
    "discoveries_li4": "KiCadのような現代のオープンソースソフトウェアのおかげで、基板設計は思っているほど怖くない。",
    "discoveries_li5": "キーボードに「フリーサイズ」の解決策はない。パーソナライズが鍵である。",
    "discoveries_p2": "また、シリコンを充填したケースが優れた静音効果をもたらすことも発見しましたが、最終的なケースをホットグルーを積層して作ってみたらどうなるか、試してみたいという誘惑に今も駆られています。",
    "plans_h2": "今後の計画",
    "plans_h3_layout": "配列の改訂（Sunshine V2）",
    "plans_p1": "第2版では、少し「テンティング」（左右のパーツを中央で上向きに傾けること）を追加したり、DactylやKinesis Advantageキーボードのように、キーウェル（指を置く窪み）にもっと大胆な曲面を試したりしてみたいです。",
    "plans_h3_features": "新しいハードウェア機能",
    "plans_p2": "現在のレイヤーを表示するための小型OLEDスクリーンや、マウスを不要にするために親指の下に小さなトラックボールかトラックパッドを追加することに興味があります。",
    "plans_h3_production": "製造と共有",
    "plans_p3": "すべての設計ファイル（KiCad、ケースモデル）を近々GitHubで公開する予定です。共同購入の計画はありませんが、これらのファイルが自分だけの完璧なキーボードを作りたいと思っている他の人々にとって役立つことを願っています。",
    "bye_h2": "おわりに（今のところは）",
    "bye_p1": "私のキーボードの旅を読んでいただきありがとうございました！サンシャインキーボードの製作は、私がこれまで手がけた中で最も挑戦的でやりがいのあるプロジェクトの一つでした。これは単なる道具ではなく、私たちがコンピュータとどう向き合うかという哲学の反映です。ご質問があれば、お気軽にご連絡ください。"
  },
  "gt": {
    "sunshine_title": "  ",
    "win_gallerynav_title": "◈ .nav",
    "sun_win_gallery_title": "▤ .article",
    "nav_h2_tldr": "",
    "nav_h2_intro": "",
    "nav_h2_objectives": "",
    "nav_h2_design": " ",
    "nav_h3_cad": "&ensp;  ",
    "nav_h4_final": "&emsp; ",
    "nav_h3_pcb": "&ensp;  PCB",
    "nav_h3_keymap": "&ensp; ",
    "nav_h2_discoveries": "",
    "nav_h3_plans": "&ensp; ",
    "nav_h2_bye": " ",
    "nav_h2_home": "⌂←",
    "sunshine_h1": "  ",
    "sunshine_p1": "     , ,        .                           .",
    "sunshine_p2": "        ,          PCB    .     .",
    "tldr_h2": " (TL;DR)",
    "tldr_p1": "           36 .         ()    ,             .      ,    PCB   ,     QMK . ' ,  ' .       :",
    "intro_h2": " & ",
    "intro_p1": "      , '      .       ,   Lily58,        ,  '   .        .",
    "intro_p2": "       ** ,    .        ,         (sub-40%).    :                  ?",
    "intro_p3": "      :       , '     .",
    "objectives_h2": " ",
    "objectives_p1": "   ,           .          .",
    "objectives_h3_theory": "      ",
    "objectives_h4_phalanges": " :  ",
    "objectives_p2": "            .         '   .  ,       ,           <kbd>Space</kbd>, <kbd>Enter</kbd>,  <kbd>Backspace</kbd>.",
    "objectives_h4_combos": "  :   ",
    "objectives_p3": "     ,   .  ,           `ASDF`  `1234`.  ,  ','            ,         .  ,  <kbd>J</kbd>  <kbd>K</kbd>    <kbd>Escape</kbd>.",
    "objectives_p4": "       :",
    "objectives_li1": "3   5   ,    .",
    "objectives_li2": "       .",
    "objectives_li3": " ,   .",
    "objectives_li4": "            ,  ,     .",
    "objectives_li5": "   (QMK or ZMK).",
    "objectives_li6": "    .",
    "objectives_li7": "      - .",
    "design_h2": "  ",
    "design_p1": "  ,     Type-22,        .               .",
    "design_p2": ",  2D     '      **.  ,     .",
    "cad_h3": "CAD (  )",
    "cad_p1": "   3D       PCB,         : .       1:1         .",
    "cad_p2": "      .                 .",
    "cad_p3": " -   .        ,         .       ,     .",
    "cad_p4": "   ,       .",
    "final_h3": "  ",
    "final_p1": "         .           ,    .",
    "final_p2": "    .            .",
    "final_p3": "      .       ,     .",
    "final_p4": "    ,          .           PCB .",
    "final_p5": "             .",
    "pcb_h3": "  PCB",
    "pcb_p1": "    ,           :     (PCB).   KiCad   .   PCB ,     'ALL IS IN YOUR HANDS'.",
    "pcb_p2": "       .       ,       '' (    ).",
    "pcb_p3": "     Raspberry Pi Pico     ' , ,  -  QMK .",
    "pcb_p4": "          TRRS ,        .",
    "pcb_p5": "    Kailh - ,         .",
    "pcb_p6": "    ,      ,         Gerber   .",
    "pcb_p7": "        ,    ,    !",
    "pcb_p8": "              .",
    "keymap_h3": "  ",
    "keymap_p1": "       .     QMK.     :     ,    ,    ,         F-.        .            Escape  Tab.",
    "discoveries_h2": " & ",
    "discoveries_p1": "      .       :",
    "discoveries_li1": "     , ,      .",
    "discoveries_li2": "              .",
    "discoveries_li3": "          ,          .",
    "discoveries_li4": "  PCB      ,    -   KiCad.",
    "discoveries_li5": "   '---'   .   .",
    "discoveries_p2": "            ,                ,     .",
    "plans_h2": " ",
    "plans_h3_layout": "  (Sunshine V2)",
    "plans_p1": "   ,          (      )          ,    Dactyl  Kinesis Advantage .",
    "plans_h3_features": "  ",
    "plans_p2": "'      OLED      ,                 .",
    "plans_h3_production": " & ",
    "plans_p3": "        (KiCad,  )  GitHub .  '      ,                 .",
    "bye_h2": "  ( )",
    "bye_p1": "      !               '  . '    ,             .     ,     ."
  }
}