{
  "en": {
    "tbns_win_gallery_title":"RSS.article",
    "tbns_title": "This Blog Now Supports RSS",
    "tbns_nav_title": "RSS",
    "tbns_desc": "I'm now supporting RSS on my blog, you can access it by clicking on the satellite icon at the top bar of the blog view.",
    "tbns_h2_reorganizing-some-stuff": "Reorganizing Some Stuff",
    "tbns_nav_reorganizing-some-stuff": "<strong>&ensp;Reorganizing Some Stuff</strong>",
    "tbns_p1": "If you were familiar with my site before, you may notice I've rearranged my \"photo folder\" and \"projects folder\". These used to use different theming and looked totally different based on when in life I had learned about divs or other important html elements.&nbsp;",
    "tbns_p2": "Now, both genres use the standard article layout I developed 2 years ago, and are sorted in the blog viewer. While I think this way of doing things does take away from the idea of having different \"folders\" with organized genres of content in them, I think&nbsp;",
    "tbns_p3": "<ol><li>• Ultimately they're formatted as blog articles and should be treated as such.</li><li>• This method is far more scalable.&nbsp;</li></ol>",
    "tbns_p4": "Feel free to sort through them with the categories. I will add a search function when I have enough posts for that to be necessary.&nbsp;",
    "tbns_h2_replacing-substack": "Replacing SubStack",
    "tbns_nav_replacing-substack": "<strong>&ensp;Replacing SubStack</strong>",
    "tbns_p5": "Lately, I've seen many <abbr title=\"Yes, I'm using that word. Would you have prefered people-of-network?\">netizens</abbr>&nbsp;adopt <a href=\"https://substack.com/\">Substack</a>&nbsp;as their tool-of-choice for creating blogs and newsletters. I like Substack! It's a good platform. I enjoy using it, and while that's mostly a result of the content available, I won't pretend I'd have found half the blogs I read had they not used Substack.",
    "tbns_h3_what-i-like-about-substack": "What I like about Substack:",
    "tbns_nav_what-i-like-about-substack": "&emsp;&emsp;What I like",
    "tbns_p6": "<ul><li>• Principled refusal to \"police extremist content\".</li><li>• Great range of publications, it has captured many disparate markets.</li><li>• Free to use, with a fair business model for those who do want to make money.</li><li>• Very easy to give creators money.</li><li>• LaTeX support.</li><li>• Datawrapper support.</li></ul>",
    "tbns_nav_what-i-dislike-about-substack":"&emsp;&emsp;What I hate",
    "tbns_h3_what-i-dislike-about-substack":"What I hate about Substack:",
    "tbns_p7": "<ul><li>• Email-centric design.</li><li>• My inbox is now all emails from Substack.</li><li>• I do not want the email addresses of people who read my blog.</li><li>• I do not want to give my email address to people whose newsletters I read.</li><li>• No custom CSS.</li></ul>",
    "tbns_nav_what-i-want":"&emsp;&emsp;What I want",
    "tbns_h3_what-i-want":"Things Substack could obviously never include but I want:",
    "tbns_p7.5": "<div><ul><li>• Chart.js Support.</li><li>• Interactive demos.</li></ul><aside>Totally not hints of anything to come.</aside><br></div>I think—for most people—Substack is exactly what they're looking for when it comes to publicly-posted long-form writing. For anyone for whom their email inbox is too sacred to profane or is particularly picky about CSS, <a href=\"https://wordpress.com/\">WordPress</a> is probably the right alternative. For me, I've gone with neither. I find it's really fun to learn and struggle through making my own website, especially with AI to hold my hand since I'm phenomenally thickheaded and need one-on-one tutoring from a being with inhuman patience.",
    "tbns_h2_resolving-a-significant-snag": "Resolving Significant Snags",
    "tbns_nav_resolving-a-significant-snag": "<strong>&ensp;Resolving Significant Snags</strong>",
    "tbns_p8": "So, I refuse to use email-centric solutions like newsletters because the idea makes me puke, but I also hate the idea of people having to manually check my blog. There's only one solution, isn't there?",
    "tbns_p9": "I remembered the concept of RSS from when I was a child. The little orange square that once sat on every single webpage on the internet, right? That was as far as my knowledge went. I didn't even know Flipboard, my dad's favorite app on his iPad, was an RSS reader. It was not super easy to learn about. If you type RSS into your search bar, you get a website with the same name that seems to be dedicated to podcasting. There are a ton of services related to automating RSS feed generation and enabling subscription that Google chooses to prioritize over useful information.",
    "tbns_p10": "It was initially unclear to me that all I needed in order to have an RSS feed was a single XML file, but eventually I set up an extension for my VScode so I could build the feed out of html files in my blog folder and their localizations.&nbsp;&nbsp;",
    "tbns_p11": "This is exactly the right solution for my preferences. It's up to the subscriber if and how they see my content. If they want it in their email, it's their choice and I will have no part in it. Perfect!",
    "tbns_p12": "All I have to do now is offer my <abbr title=\"Available in 4 languages, and 2 orthographies in English, click the satellite icon on my blog view on my homepage.\">rss feed</abbr> and... wait... how does one even read RSS?",
    "tbns_h2_rapacious-subscription-services": "Rapacious Subscription Services",
    "tbns_nav_rapacious-subscription-services": "<strong>&ensp;Rapacious Sub Services</strong>",
    "tbns_p13": "If you do not use RSS yet but would like to, I would like to inform you that it is totally free. If you're on android, use <a href=\"https://f-droid.org/en/packages/com.nononsenseapps.feeder/\">Feeder</a>. If you're on iOS, I'm sure there are also options, but I can't vouch for them. If you want to sync what you've read or not, you might want your own server. There are many services which offer very specific features that you <i>might</i> not care about but are immensely valuable to certain kinds of users. I like that these exist, but I don't like that they are prioritized above the correct solution for your use case if you search for it on Google.",
    "tbns_p15": "<aside>You may want synced read history or services that can scrape from websites that offer incomplete rss feeds, if so, you'll find this very easily.&nbsp;</aside>"
  },
  "ja": {
    "tbns_win_gallery_title": "RSS.article",
    "tbns_title": "このブログはRSSに対応しました",
    "tbns_nav_title": "RSS",
    "tbns_desc": "私のブログがRSSに対応しました。ブログビューの上部にある衛星アイコンをクリックするとアクセスできます。",
    "tbns_h2_reorganizing-some-stuff": "リフレッシュ！サイト・ストラクチャー (Rifresshu! Saito Sutorakuchā)",
    "tbns_nav_reorganizing-some-stuff": "<strong>&ensp;リフレッシュ！サイト・ストラクチャー (R.S.S.)</strong>",
    "tbns_p1": "以前から私のサイトをご存知の方は、「写真フォルダー」と「プロジェクトフォルダー」を再編成したことにお気づきかもしれません。これらは以前、別々のテーマを使用していて、人生のどの時点でdivや他の重要なHTML要素について学んだかによって、全く違う見た目になっていました。",
    "tbns_p2": "現在は、どちらのジャンルも2年前に開発した標準の記事レイアウトを使用し、ブログビューアで分類されています。このやり方は、コンテンツのジャンルごとに整理された別々の「フォルダー」を持つという考えからは少し離れてしまうと思いますが、でもまあ、",
    "tbns_p3": "<ol><li>• 最終的にはブログ記事としてフォーマットされているのだから、そのように扱うべき。</li><li>• この方法の方がはるかに拡張性が高い。</li></ol>",
    "tbns_p4": "カテゴリーを使って自由に分類してみてください。検索機能は、それが必要になるほど記事が増えたら追加します。",
    "tbns_h2_replacing-substack": "楽々シンジケーション・システム (Raku-raku Shinjikēshon Shisutemu)",
    "tbns_nav_replacing-substack": "<strong>&ensp;楽々シンジケーション・システム (R.S.S.)</strong>",
    "tbns_p5": "最近、多くの<abbr title=\"はい、この言葉を使っています。「ネットワークの民」の方がよかったですか？\">ネチズン</abbr>がブログやニュースレターを作成するためのツールとして<a href=\"https://substack.com/\">Substack</a>を選んでいます。Substackは好きですよ！良いプラットフォームです。利用していて楽しいですし、それは主に利用可能なコンテンツのおかげですが、もし彼らがSubstackを使っていなかったら、私が読んでいるブログの半分は見つけられなかっただろうとは言っておきます。",
    "tbns_h3_what-i-like-about-substack": "Substackの好きなところ：",
    "tbns_nav_what-i-like-about-substack": "&emsp;&emsp;好きなところ",
    "tbns_p6": "<ul><li>• 「過激なコンテンツを取り締まる」ことを原則として拒否している点。</li><li>•出版物の幅が広く、多くの異なる市場を取り込んでいる点。</li><li>• 無料で利用でき、収益を上げたい人には公正なビジネスモデルがある点。</li><li>•クリエイターにお金を渡すのがとても簡単な点。</li><li>• LaTeX対応。</li><li>• Datawrapper対応。</li></ul>",
    "tbns_nav_what-i-dislike-about-substack": "&emsp;&emsp;嫌いなところ",
    "tbns_h3_what-i-dislike-about-substack": "Substackの嫌いなところ：",
    "tbns_p7": "<ul><li>• メール中心の設計。</li><li>• 私の受信箱は今やSubstackからのメールでいっぱいです。</li><li>• 私のブログを読んでくれる人のメールアドレスは要りません。</li><li>• ニュースレターを読んでいる人のメールアドレスを渡したくありません。</li><li>• カスタムCSSが使えない。</li></ul>",
    "tbns_nav_what-i-want": "&emsp;&emsp;欲しいもの",
    "tbns_h3_what-i-want": "Substackには絶対に含まれないだろうけど、私が欲しいもの：",
    "tbns_p7.5": "<div><ul><li>• Chart.js対応。</li><li>•インタラクティブなデモ。</li></ul><aside>今後の展開のヒントじゃないんだからね。</aside><br></div>ほとんどの人にとって、Substackは公に投稿される長文の文章に関して、まさに求めているものだと思います。メールの受信箱を汚されるのが神聖な儀式に反すると感じる人や、CSSに特にうるさい人にとっては、<a href=\"https://wordpress.com/\">WordPress</a>がおそらく正しい代替案でしょう。私自身は、どちらも選びませんでした。自分でウェブサイトを作ることの学びと苦労は本当に楽しいです。特に、私が驚くほど頭が固く、超人的な忍耐力を持つ存在から一対一の指導を必要とするので、AIが手を貸してくれるようになってからは尚更です。",
    "tbns_h2_resolving-a-significant-snag": "楽勝する術 (Rakushō Suru Sube)",
    "tbns_nav_resolving-a-significant-snag": "<strong>&ensp;楽勝する術 (R.S.S.)</strong>",
    "tbns_p8": "というわけで、ニュースレターのようなメール中心のソリューションは、その考えだけで吐き気がするので拒否しますが、人々が手動で私のブログをチェックしなければならないというのも嫌いです。解決策は一つしかないですよね？",
    "tbns_p9": "子供の頃にRSSという概念を思い出しました。かつてインターネット上のあらゆるウェブページにあった、あの小さなオレンジ色の四角いアイコンですよね？私の知識はそこまででした。父がiPadで一番好きだったアプリ、FlipboardがRSSリーダーだということすら知りませんでした。RSSについて学ぶのは、あまり簡単ではありませんでした。検索バーに「RSS」と入力すると、同じ名前のウェブサイトが出てきますが、それはポッドキャスティング専門のようです。Googleが有益な情報よりも優先して表示するのは、RSSフィードの生成を自動化したり、購読を可能にしたりする関連サービスばかりです。",
    "tbns_p10": "RSSフィードを持つために必要なのが単一のXMLファイルだけだとは、最初はよく分かりませんでした。しかし、最終的にはVScodeに拡張機能 を設定し、ブログフォルダー内のHTMLファイルとそのローカライゼーションからフィードを構築できるようにしました。",
    "tbns_p11": "これは私の好みにぴったりの解決策です。私のコンテンツをどう見るかは、購読者次第。メールで受け取りたいなら、それは彼らの選択であり、私は一切関与しません。完璧です！",
    "tbns_p12": "あとは私の<abbr title=\"4つの言語と、英語の2つの表記法で利用可能です。ホームページのブログビューにある衛星アイコンをクリックしてください。\">rssフィード</abbr>を提供するだけ…待って…RSSってどうやって読むの？",
    "tbns_h2_rapacious-subscription-services": "ろくでもない集金システム (Rokudemonai Shūkin System)",
    "tbns_nav_rapacious-subscription-services": "<strong>&ensp;ろくでもない集金システム (R.S.S.)</strong>",
    "tbns_p13": "まだRSSを使っていないけれど使ってみたいという方にお伝えしたいのですが、これは完全に無料です。Androidをお使いなら、<a href=\"https://f-droid.org/en/packages/com.nononsenseapps.feeder/\">Feeder</a>を使ってください。iOSをお使いなら、きっと他の選択肢もあると思いますが、私が保証することはできません。既読・未読を同期したい場合は、自分用のサーバーが必要になるかもしれません。特定の種類のユーザーにとっては非常に価値があるけれど、あなたにとっては気にしないかもしれない、非常に特殊な機能を提供するサービスはたくさんあります。そういったサービスが存在するのは良いことだと思いますが、Googleで検索したときに、あなたのユースケースにとっての正しい解決策よりも優先されて表示されるのは気に入りません。",
    "tbns_p15": "<aside>既読履歴の同期や、不完全なRSSフィードしか提供しないウェブサイトから情報を取得（スクレイピング）できるサービスが必要な場合もあるでしょう。もしそうなら、簡単に見つかりますよ。</aside>"
  },
  "de": {
    "tbns_win_gallery_title": "RSS.artikel",
    "tbns_title": "Dieser Blog unterstützt jetzt RSS",
    "tbns_nav_title": "RSS",
    "tbns_desc": "Mein Blog unterstützt jetzt RSS. Du kannst darauf zugreifen, indem du auf das Satelliten-Symbol in der oberen Leiste der Blog-Ansicht klickst.",
    "tbns_h2_reorganizing-some-stuff": "Radikal Simplifiziertes System",
    "tbns_nav_reorganizing-some-stuff": "<strong>&ensp;Radikal Simplifiziertes System</strong>",
    "tbns_p1": "Falls du meine Seite von früher kennst, ist dir vielleicht aufgefallen, dass ich meinen „Foto-Ordner“ und „Projekte-Ordner“ neu angeordnet habe. Früher hatten die unterschiedliche Designs und sahen total verschieden aus, je nachdem, wann in meinem Leben ich etwas über divs oder andere wichtige HTML-Elemente gelernt hatte.&nbsp;",
    "tbns_p2": "Jetzt verwenden beide Genres das Standard-Artikel-Layout, das ich vor 2 Jahren entwickelt habe, und werden in der Blog-Übersicht sortiert. Obwohl ich finde, dass diese Vorgehensweise ein wenig von der Idee abweicht, verschiedene „Ordner“ mit organisierten Inhaltsgenres zu haben, denke ich,&nbsp;",
    "tbns_p3": "<ol><li>• Letztendlich sind sie als Blog-Artikel formatiert und sollten auch als solche behandelt werden.</li><li>• Diese Methode ist weitaus skalierbarer.&nbsp;</li></ol>",
    "tbns_p4": "Du kannst sie gerne mit den Kategorien durchsortieren. Eine Suchfunktion werde ich hinzufügen, sobald ich genug Beiträge habe, damit sich das lohnt.&nbsp;",
    "tbns_h2_replacing-substack": "Richtig Simple Substitution",
    "tbns_nav_replacing-substack": "<strong>&ensp;Richtig Simple Substitution</strong>",
    "tbns_p5": "In letzter Zeit habe ich gesehen, wie viele <abbr title=\"Ja, ich benutze dieses Wort. Hätten Sie 'Leute-aus-dem-Netzwerk' bevorzugt?\">Netzbürger</abbr>&nbsp;<a href=\"https://substack.com/\">Substack</a>&nbsp;als ihr bevorzugtes Werkzeug für die Erstellung von Blogs und Newslettern annehmen. Ich mag Substack! Es ist eine gute Plattform. Ich benutze es gerne, und obwohl das hauptsächlich am verfügbaren Inhalt liegt, werde ich nicht so tun, als hätte ich die Hälfte der Blogs, die ich lese, gefunden, wenn sie Substack nicht benutzt hätten.",
    "tbns_h3_what-i-like-about-substack": "Was ich an Substack mag:",
    "tbns_nav_what-i-like-about-substack": "&emsp;&emsp;Was ich mag",
    "tbns_p6": "<ul><li>• Prinzipielle Weigerung, „extremistische Inhalte zu überwachen“.</li><li>• Große Auswahl an Publikationen, es hat viele unterschiedliche Märkte erobert.</li><li>• Kostenlos nutzbar, mit einem fairen Geschäftsmodell für diejenigen, die Geld verdienen wollen.</li><li>• Sehr einfach, Kreativen Geld zu geben.</li><li>• LaTeX-Unterstützung.</li><li>• Datawrapper-Unterstützung.</li></ul>",
    "tbns_nav_what-i-dislike-about-substack": "&emsp;&emsp;Was ich hasse",
    "tbns_h3_what-i-dislike-about-substack": "Was ich an Substack hasse:",
    "tbns_p7": "<ul><li>• E-Mail-zentriertes Design.</li><li>• Mein Posteingang besteht jetzt nur noch aus E-Mails von Substack.</li><li>• Ich will die E-Mail-Adressen der Leute, die meinen Blog lesen, nicht haben.</li><li>• Ich will meine E-Mail-Adresse nicht den Leuten geben, deren Newsletter ich lese.</li><li>• Kein benutzerdefiniertes CSS.</li></ul>",
    "tbns_nav_what-i-want": "&emsp;&emsp;Was ich will",
    "tbns_h3_what-i-want": "Dinge, die Substack offensichtlich nie einbauen könnte, die ich aber will:",
    "tbns_p7.5": "<div><ul><li>• Chart.js-Unterstützung.</li><li>• Interaktive Demos.</li></ul><aside>Absolut keine Andeutungen auf kommende Dinge.</aside><br></div>Ich denke, für die meisten Leute ist Substack genau das, was sie suchen, wenn es um öffentlich gepostete, lange Texte geht. Für jeden, dessen E-Mail-Posteingang zu heilig ist, um ihn zu entweihen, oder der besonders wählerisch bei CSS ist, ist <a href=\"https://wordpress.com/\">WordPress</a> wahrscheinlich die richtige Alternative. Ich für meinen Teil habe mich für keines von beiden entschieden. Ich finde es macht richtig Spaß, zu lernen und mich beim Erstellen meiner eigenen Website abzumühen, besonders mit einer KI, die mir Händchen hält, da ich phänomenal begriffsstutzig bin und Nachhilfe von einem Wesen mit unmenschlicher Geduld brauche.",
    "tbns_h2_resolving-a-significant-snag": "Richtig Smarte Strategie",
    "tbns_nav_resolving-a-significant-snag": "<strong>&ensp;Richtig Smarte Strategie</strong>",
    "tbns_p8": "Also, ich weigere mich, E-Mail-zentrierte Lösungen wie Newsletter zu verwenden, weil ich bei der Vorstellung kotzen könnte, aber ich hasse auch die Idee, dass Leute meinen Blog manuell überprüfen müssen. Es gibt nur eine Lösung, oder?",
    "tbns_p9": "Ich erinnerte mich an das Konzept von RSS aus meiner Kindheit. Dieses kleine orangefarbene Quadrat, das früher auf jeder einzelnen Webseite im Internet zu finden war, richtig? Soweit reichte mein Wissen. Ich wusste nicht einmal, dass Flipboard, die Lieblings-App meines Vaters auf seinem iPad, ein RSS-Reader war. Es war nicht super einfach, darüber zu lernen. Wenn man RSS in die Suchleiste eingibt, erhält man eine Website mit demselben Namen, die sich dem Podcasting zu widmen scheint. Es gibt eine Menge Dienste zur Automatisierung der RSS-Feed-Erstellung und zur Ermöglichung von Abonnements, die Google lieber priorisiert als nützliche Informationen.",
    "tbns_p10": "Anfangs war mir nicht klar, dass alles, was ich für einen RSS-Feed brauchte, eine einzige XML-Datei war, aber schließlich habe ich eine Erweiterung für mein VScode eingerichtet, damit ich den Feed aus den HTML-Dateien in meinem Blog-Ordner und ihren Lokalisierungen erstellen kann.&nbsp;&nbsp;",
    "tbns_p11": "Das ist genau die richtige Lösung für meine Vorlieben. Es liegt am Abonnenten, ob und wie er meine Inhalte sieht. Wenn sie es in ihrer E-Mail haben wollen, ist das ihre Entscheidung und ich habe nichts damit zu tun. Perfekt!",
    "tbns_p12": "Alles, was ich jetzt tun muss, ist meinen <abbr title=\"Verfügbar in 4 Sprachen und 2 englischen Orthographien, klicke auf das Satelliten-Symbol in meiner Blog-Ansicht auf meiner Homepage.\">RSS-Feed</abbr> anzubieten und... Moment mal... wie liest man überhaupt RSS?",
    "tbns_h2_rapacious-subscription-services": "Raffgierige Subskriptions-Services",
    "tbns_nav_rapacious-subscription-services": "<strong>&ensp;Raffgierige Sub-Services</strong>",
    "tbns_p13": "Wenn du noch kein RSS nutzt, aber gerne möchtest, möchte ich dich informieren, dass es völlig kostenlos ist. Wenn du auf Android bist, benutze <a href=\"https://f-droid.org/en/packages/com.nononsenseapps.feeder/\">Feeder</a>. Wenn du auf iOS bist, bin ich sicher, dass es auch Optionen gibt, aber für die kann ich nicht bürgen. Wenn du synchronisieren willst, was du gelesen hast und was nicht, möchtest du vielleicht deinen eigenen Server. Es gibt viele Dienste, die sehr spezifische Funktionen anbieten, die dich <i>vielleicht</i> nicht interessieren, aber für bestimmte Arten von Nutzern immens wertvoll sind. Ich finde es gut, dass es diese gibt, aber ich mag es nicht, dass sie über der richtigen Lösung für deinen Anwendungsfall priorisiert werden, wenn du bei Google danach suchst.",
    "tbns_p15": "<aside>Vielleicht möchtest du einen synchronisierten Leseverlauf oder Dienste, die von Websites scrapen können, die unvollständige RSS-Feeds anbieten. Falls ja, wirst du das sehr leicht finden.&nbsp;</aside>"
  },
  "he": {
    "tbns_win_gallery_title": "RSS.article",
    "tbns_title": "הבלוג תומך עכשיו ב-RSS",
    "tbns_nav_title": "RSS",
    "tbns_desc": "הבלוג שלי תומך עכשיו ב-RSS. אפשר לגשת לפיד על ידי לחיצה על אייקון הלוויין בסרגל העליון של תצוגת הבלוג.",
    "tbns_h2_reorganizing-some-stuff": "רציונליזציה של שטויות",
    "tbns_nav_reorganizing-some-stuff": "<strong>&ensp;רציונליזציה של שטויות</strong>",
    "tbns_p1": "אם הכרתם את האתר שלי מלפני כן, אולי שמתם לב שסידרתי מחדש את \"תיקיית התמונות\" ו\"תיקיית הפרויקטים\". פעם הן השתמשו בעיצובים שונים ונראו אחרת לגמרי, תלוי באיזה שלב בחיים למדתי על div-ים או אלמנטים חשובים אחרים של HTML.&nbsp;",
    "tbns_p2": "עכשיו, שני הז'אנרים משתמשים בלייאאוט המאמרים הסטנדרטי שפיתחתי לפני שנתיים, והם ממוינים בתצוגת הבלוג. למרות שאני חושבת שהדרך הזאת קצת פוגעת ברעיון של \"תיקיות\" נפרדות עם ז'אנרים מאורגנים של תוכן, אני חושבת ש&nbsp;",
    "tbns_p3": "<ol><li>• בסופו של דבר הם מעוצבים כמאמרי בלוג וצריך להתייחס אליהם ככאלה.</li><li>• השיטה הזאת הרבה יותר סקיילבילית.&nbsp;</li></ol>",
    "tbns_p4": "אתם מוזמנים למיין אותם בעזרת הקטגוריות. אני אוסיף פונקציית חיפוש כשיהיו לי מספיק פוסטים כדי שזה יהיה נחוץ.&nbsp;",
    "tbns_h2_replacing-substack": "רוצה שקט, שונאת סאבסטק",
    "tbns_nav_replacing-substack": "<strong>&ensp;רוצה שקט, שונאת סאבסטק</strong>",
    "tbns_p5": "לאחרונה, ראיתי הרבה <abbr title=\"כן, אני משתמשת במילה הזאת. העדפתם 'אנשי-רשת'?\">גולשים</abbr>&nbsp;מאמצים את <a href=\"https://substack.com/\">Substack</a>&nbsp;ככלי המועדף עליהם ליצירת בלוגים וניוזלטרים. אני אוהבת את Substack! זאת פלטפורמה טובה. אני נהנית להשתמש בה, ולמרות שזה בעיקר תוצאה של התוכן הזמין, אני לא אעמיד פנים שהייתי מוצאת חצי מהבלוגים שאני קוראת אם הם לא היו משתמשים ב-Substack.",
    "tbns_h3_what-i-like-about-substack": "מה אני אוהבת ב-Substack:",
    "tbns_nav_what-i-like-about-substack": "&emsp;&emsp;מה שאני אוהבת",
    "tbns_p6": "<ul><li>• סירוב עקרוני ל\"צנזר תוכן קיצוני\".</li><li>• מגוון רחב של פרסומים, הוא כבש שווקים רבים ושונים.</li><li>• חינמי לשימוש, עם מודל עסקי הוגן למי שכן רוצה להרוויח כסף.</li><li>• קל מאוד לתת כסף ליוצרים.</li><li>• תמיכה ב-LaTeX.</li><li>• תמיכה ב-Datawrapper.</li></ul>",
    "tbns_nav_what-i-dislike-about-substack": "&emsp;&emsp;מה שאני שונאת",
    "tbns_h3_what-i-dislike-about-substack": "מה אני שונאת ב-Substack:",
    "tbns_p7": "<ul><li>• עיצוב שמתרכז במייל.</li><li>• תיבת הדואר הנכנס שלי מלאה עכשיו במיילים מ-Substack.</li><li>• אני לא רוצה את כתובות המייל של האנשים שקוראים את הבלוג שלי.</li><li>• אני לא רוצה לתת את כתובת המייל שלי לאנשים שאני קוראת את הניוזלטרים שלהם.</li><li>• אין CSS מותאם אישית.</li></ul>",
    "tbns_nav_what-i-want": "&emsp;&emsp;מה שאני רוצה",
    "tbns_h3_what-i-want": "דברים ש-Substack בחיים לא יוסיפו אבל אני רוצה:",
    "tbns_p7.5": "<div><ul><li>• תמיכה ב-Chart.js.</li><li>• הדגמות אינטראקטיביות.</li></ul><aside>לגמרי לא רמזים לדברים שיבואו.</aside><br></div>אני חושבת שעבור רוב האנשים, Substack הוא בדיוק מה שהם מחפשים כשמדובר בכתיבה ארוכה שמתפרסמת באופן ציבורי. לכל מי שתיבת המייל שלו קדושה מדי לחילול או שהוא אנין טעם במיוחד לגבי CSS, <a href=\"https://wordpress.com/\">WordPress</a> היא כנראה האלטרנטיבה הנכונה. אני, מצדי, לא בחרתי באף אחד מהם. אני מגלה שזה ממש כיף ללמוד ולהיאבק בבניית אתר משלי, במיוחד כשיש לי AI שמחזיק לי את היד, כי אני אטומה בטירוף וזקוקה לשיעורים פרטיים מישות עם סבלנות על-אנושית.",
    "tbns_h2_resolving-a-significant-snag": "רעיון שפותר שטויות",
    "tbns_nav_resolving-a-significant-snag": "<strong>&ensp;רעיון שפותר שטויות</strong>",
    "tbns_p8": "אז, אני מסרבת להשתמש בפתרונות מבוססי מייל כמו ניוזלטרים כי הרעיון גורם לי להקיא, אבל אני גם שונאת את המחשבה שאנשים יצטרכו לבדוק את הבלוג שלי ידנית. יש רק פתרון אחד, לא?",
    "tbns_p9": "נזכרתי במושג RSS מהילדות. הריבוע הכתום הקטן הזה שהיה פעם בכל עמוד אינטרנט, נכון? הידע שלי נגמר שם. אפילו לא ידעתי ש-Flipboard, האפליקציה האהובה על אבא שלי באייפד שלו, היא קורא RSS. לא היה סופר קל ללמוד על זה. אם מקלידים RSS בשורת החיפוש, מקבלים אתר באותו שם שנראה שמוקדש לפודקאסטים. יש טונה של שירותים שקשורים לאוטומציה של יצירת פיד RSS ומתן אפשרות למנוי, שגוגל בוחרת לתעדף על פני מידע שימושי.",
    "tbns_p10": "בהתחלה לא היה לי ברור שכל מה שאני צריכה כדי שיהיה לי פיד RSS זה קובץ XML בודד, אבל בסוף התקנתי תוסף ל-VScode שלי כדי שאוכל לבנות את הפיד מקבצי ה-HTML שבתיקיית הבלוג שלי ומהלוקליזציות שלהם.&nbsp;&nbsp;",
    "tbns_p11": "זה בדיוק הפתרון הנכון להעדפות שלי. זו החלטה של המנוי אם ואיך הוא רואה את התוכן שלי. אם הוא רוצה את זה במייל שלו, זו הבחירה שלו ולי לא יהיה שום חלק בזה. מושלם!",
    "tbns_p12": "כל מה שאני צריכה לעשות עכשיו זה להציע את <abbr title=\"זמין ב-4 שפות, וב-2 אורתוגרפיות באנגלית. לחצו על אייקון הלוויין בתצוגת הבלוג בדף הבית שלי.\">פיד ה-RSS</abbr> שלי ו... רגע... איך בכלל קוראים RSS?",
    "tbns_h2_rapacious-subscription-services": "רדיפת שקל שקל",
    "tbns_nav_rapacious-subscription-services": "<strong>&ensp;רדיפת שקל שקל</strong>",
    "tbns_p13": "אם אתם עוד לא משתמשים ב-RSS אבל רוצים, חשוב לי להודיע לכם שזה חינמי לגמרי. אם אתם באנדרואיד, השתמשו ב-<a href=\"https://f-droid.org/en/packages/com.nononsenseapps.feeder/\">Feeder</a>. אם אתם ב-iOS, אני בטוחה שיש גם אפשרויות, אבל אני לא יכולה לערוב להן. אם אתם רוצים לסנכרן מה קראתם ומה לא, אולי תרצו שרת משלכם. יש הרבה שירותים שמציעים פיצ'רים מאוד ספציפיים ש<i>אולי</i> לא אכפת לכם מהם אבל הם בעלי ערך עצום לסוגים מסוימים של משתמשים. אני אוהבת שהם קיימים, אבל אני לא אוהבת שהם מקבלים עדיפות על פני הפתרון הנכון למקרה השימוש שלכם כשאתם מחפשים אותו בגוגל.",
    "tbns_p15": "<aside>יכול להיות שתרצו היסטוריית קריאה מסונכרנת או שירותים שיודעים לגרד מידע מאתרים שמציעים פיד RSS חלקי, אם כן, תמצאו את זה בקלות רבה.&nbsp;</aside>"
  },
  "ru": {
    "tbns_win_gallery_title": "RSS.article",
    "tbns_title": "Этот блог теперь поддерживает RSS",
    "tbns_nav_title": "RSS",
    "tbns_desc": "Теперь мой блог поддерживает RSS. Получить доступ к ленте можно, кликнув на иконку спутника в верхнем меню блога.",
    "tbns_h2_reorganizing-some-stuff": "Радикальная Сортировка Старого",
    "tbns_nav_reorganizing-some-stuff": "<strong>&ensp;Радикальная Сортировка Старого</strong>",
    "tbns_p1": "Если ты был знаком с моим сайтом раньше, то мог заметить, что я переделала свои «папку с фото» и «папку с проектами». Раньше у них были разные темы, и выглядели они совершенно по-разному — в зависимости от того, на каком этапе жизни я узнала о div'ах и других важных элементах HTML.&nbsp;",
    "tbns_p2": "Теперь оба жанра используют стандартный дизайн статей, который я разработала 2 года назад, и отсортированы в общем каталоге блога. Хотя я думаю, что такой подход немного отходит от идеи иметь разные «папки» с организованным по жанрам контентом, я считаю, что&nbsp;",
    "tbns_p3": "<ol><li>• В конечном итоге они оформлены как статьи в блоге и должны рассматриваться именно так.</li><li>• Этот метод гораздо лучше масштабируется.&nbsp;</li></ol>",
    "tbns_p4": "Смело сортируй их по категориям. Функцию поиска я добавлю, когда постов станет достаточно, чтобы в ней появилась необходимость.&nbsp;",
    "tbns_h2_replacing-substack": "Решительно Сносим Substack",
    "tbns_nav_replacing-substack": "<strong>&ensp;Решительно Сносим Substack</strong>",
    "tbns_p5": "В последнее время я вижу, как многие <abbr title=\"Да, я использую это слово. Ты бы предпочел 'люди-из-сети'?\">сетизены</abbr>&nbsp;выбирают <a href=\"https://substack.com/\">Substack</a>&nbsp;в качестве основного инструмента для создания блогов и рассылок. Мне нравится Substack! Это хорошая платформа. Я с удовольствием ей пользуюсь, и хотя это в основном из-за доступного контента, не буду притворяться, что нашла бы и половину блогов, которые читаю, если бы они не использовали Substack.",
    "tbns_h3_what-i-like-about-substack": "Что мне нравится в Substack:",
    "tbns_nav_what-i-like-about-substack": "&emsp;&emsp;Что нравится",
    "tbns_p6": "<ul><li>• Принципиальный отказ от «цензуры экстремистского контента».</li><li>• Огромный выбор публикаций, он захватил множество разных рынков.</li><li>• Бесплатное использование с честной бизнес-моделью для тех, кто хочет зарабатывать.</li><li>• Очень легко переводить деньги авторам.</li><li>• Поддержка LaTeX.</li><li>• Поддержка Datawrapper.</li></ul>",
    "tbns_nav_what-i-dislike-about-substack": "&emsp;&emsp;Что бесит",
    "tbns_h3_what-i-dislike-about-substack": "Что меня бесит в Substack:",
    "tbns_p7": "<ul><li>• Дизайн, ориентированный на почту.</li><li>• Мой почтовый ящик теперь забит письмами от Substack.</li><li>• Я не хочу знать имейлы людей, которые читают мой блог.</li><li>• Я не хочу давать свой имейл людям, чьи рассылки я читаю.</li><li>• Нет кастомного CSS.</li></ul>",
    "tbns_nav_what-i-want": "&emsp;&emsp;Чего я хочу",
    "tbns_h3_what-i-want": "Вещи, которых в Substack очевидно никогда не будет, но которые я хочу:",
    "tbns_p7.5": "<div><ul><li>• Поддержка Chart.js.</li><li>• Интерактивные демки.</li></ul><aside>Это вообще не намёки на будущее, нет.</aside><br></div>Я думаю, для большинства людей Substack — это именно то, что они ищут, когда речь заходит о публичных длинных текстах. Для тех, чей почтовый ящик слишком священен, чтобы его осквернять, или кто особенно придирчив к CSS, <a href=\"https://wordpress.com/\">WordPress</a>, вероятно, будет правильной альтернативой. Что до меня, я не выбрала ни то, ни другое. Я поняла, что учиться и мучиться, создавая свой собственный сайт, — это очень весело, особенно когда ИИ держит тебя за ручку, потому что я феноменально тугодумная и нуждаюсь в персональных уроках от существа с нечеловеческим терпением.",
    "tbns_h2_resolving-a-significant-snag": "Реально Спасительное Средство",
    "tbns_nav_resolving-a-significant-snag": "<strong>&ensp;Реально Спасительное Средство</strong>",
    "tbns_p8": "Итак, я отказываюсь использовать решения, завязанные на почте, вроде новостных рассылок, потому что от одной этой идеи меня тошнит, но я также ненавижу мысль о том, что людям придётся вручную проверять мой блог. Есть только одно решение, не так ли?",
    "tbns_p9": "Я вспомнила о концепции RSS из детства. Маленький оранжевый квадратик, который когда-то был на каждой веб-странице в интернете, верно? На этом мои знания заканчивались. Я даже не знала, что Flipboard, любимое приложение моего отца на его iPad, — это RSS-ридер. Узнать об этом оказалось не так-то просто. Если ввести RSS в поисковике, вылезает одноименный сайт, который, кажется, посвящен подкастам. Существует тонна сервисов для автоматической генерации RSS-лент и оформления подписок, которым Google отдает предпочтение перед полезной информацией.",
    "tbns_p10": "Сначала мне было неясно, что для создания RSS-ленты мне нужен всего лишь один XML-файл, но в итоге я установила расширение для VScode, чтобы собирать ленту из HTML-файлов в папке моего блога и их локализаций.&nbsp;&nbsp;",
    "tbns_p11": "Это именно то решение, которое идеально мне подходит. Подписчик сам решает, будет ли он видеть мой контент и как. Если он хочет получать его на почту — это его выбор, и я в этом не участвую. Идеально!",
    "tbns_p12": "Теперь всё, что мне нужно сделать, — это предложить свою <abbr title=\"Доступно на 4 языках и в 2 орфографиях английского. Кликни на иконку спутника в меню блога на главной странице.\">RSS-ленту</abbr> и... подождите... а как вообще читать RSS?",
    "tbns_h2_rapacious-subscription-services": "Разбойничьи Сервисы-Сосалки",
    "tbns_nav_rapacious-subscription-services": "<strong>&ensp;Разбойничьи Сервисы-Сосалки</strong>",
    "tbns_p13": "Если ты ещё не пользуешься RSS, но хочешь начать, хочу сообщить, что это абсолютно бесплатно. Если у тебя Android, используй <a href=\"https://f-droid.org/en/packages/com.nononsenseapps.feeder/\">Feeder</a>. Если у тебя iOS, уверена, тоже есть варианты, но я за них поручиться не могу. Если ты хочешь синхронизировать прочитанное, тебе может понадобиться собственный сервер. Существует множество сервисов, которые предлагают очень специфические функции, которые тебе, <i>возможно</i>, и не нужны, но для определённых пользователей они бесценны. Мне нравится, что они есть, но не нравится, что при поиске в Google они вылезают раньше, чем правильное решение для твоего случая.",
    "tbns_p15": "<aside>Возможно, тебе понадобится синхронизация истории прочтения или сервисы, которые могут вытаскивать контент с сайтов с неполными RSS-лентами. Если так, ты их очень легко найдёшь.&nbsp;</aside>"
  },
  "gt": {
    "tbns_win_gallery_title": "RSS.",
    "tbns_title": "    RSS",
    "tbns_nav_title": "RSS",
    "tbns_desc": "   RSS   ,                  .",
    "tbns_h2_reorganizing-some-stuff": "  ",
    "tbns_nav_reorganizing-some-stuff": "<strong>&ensp;  </strong>",
    "tbns_p1": "       ,       \" \"  \" \".                    divs    html .&nbsp;",
    "tbns_p2": ",          2  ,       .                  \"\"       ,   ;",
    "tbns_p3": "<ol><li>•            .</li><li>•      .&nbsp;</li></ol>",
    "tbns_p4": "        .                .&nbsp;",
    "tbns_h2_replacing-substack": " SubStack",
    "tbns_nav_replacing-substack": "<strong>&ensp; SubStack</strong>",
    "tbns_p5": ",    <abbr title=\",    .     --?\"></abbr>&nbsp; <a href=\"https://substack.com/\">Substack</a>&nbsp;  --     .   Substack!    .    ,          ,                Substack.",
    "tbns_h3_what-i-like-about-substack": "    Substack:",
    "tbns_nav_what-i-like-about-substack": "&emsp;&emsp;  ",
    "tbns_p6": "<ul><li>•    \"  \".</li><li>•    ,      .</li><li>•   ,             .</li><li>•      .</li><li>• LaTeX .</li><li>• Datawrapper .</li></ul>",
    "tbns_nav_what-i-dislike-about-substack": "&emsp;&emsp;  ",
    "tbns_h3_what-i-dislike-about-substack": "    Substack:",
    "tbns_p7": "<ul><li>• - .</li><li>•        Substack.</li><li>•             .</li><li>•               .</li><li>•   CSS.</li></ul>",
    "tbns_nav_what-i-want": "&emsp;&emsp;  ",
    "tbns_h3_what-i-want": " Substack       :",
    "tbns_p7.5": "<div><ul><li>• Chart.js Support.</li><li>•  .</li></ul><aside>      .</aside><br></div> –  —Substack           - - .                  CSS, <a href=\"https://wordpress.com/\">WordPress</a>     .  ,    .              ,   AI           --       .",
    "tbns_h2_resolving-a-significant-snag": "  ",
    "tbns_nav_resolving-a-significant-snag": "<strong>&ensp;  </strong>",
    "tbns_p8": ",     -       ,              .    ,  ?",
    "tbns_p9": "     RSS      .              , ?        .     Flipboard,       iPad,   RSS .        .    RSS    ,               .          RSS       Google      .",
    "tbns_p10": "               RSS     XML ,          VScode         html        .&nbsp;&nbsp;",
    "tbns_p11": "        .            .       ,           . !",
    "tbns_p12": "         <abbr title=\"  4 ,  2   ,           .\">rss </abbr> ... ...      RSS?",
    "tbns_h2_rapacious-subscription-services": "  ",
    "tbns_nav_rapacious-subscription-services": "<strong>&ensp;  </strong>",
    "tbns_p13": "     RSS     ,           .    android,  <a href=\"https://f-droid.org/en/packages/com.nononsenseapps.feeder/\">Feeder</a>.    iOS,      ,      .          ,      .            <i></i>            .     ,                       Google.",
    "tbns_p15": "<aside>                rss ,  ,     .&nbsp;</aside>"
  }
}
